[{"articleId":"22342","title":"Employing forward-thinking design solutions","source":"NotCot","articleLink":"http://feedproxy.google.com/~r/2modernDesignTalk/~3/NP3jNIms2_U/employing-forward-thinking-design-solutions-to-meet-todays-higher-education-facility-budgets.html","displayContent":"Flexibility and sustainability are more vital now than ever in architecture, particularly in higher education where every dollar counts. The HGA Architects and Engineers-designed Student Services Center at Monterey Peninsula College, which opened in Fall 2011, exemplifies these design principals, and showcases HGA?s ability to create a facility that can be re-purposed for the future, which is one of the most sustainable and effective ways to manage campus assets in the long-term.\n\nThe 24,000-square-foot Student Services Center centralizes several diverse programs that were once scattered across the campus, including financial aid, developmental disabilities support, registration and academic offices. The new facility was designed to be adaptable ? open to any needs the college may have and erasing the possibility of it becoming obsolete in the future.\n\nA major educational institution on the Monterey Peninsula coastline, the Monterey Peninsula College has experienced substantial growth over the past years, and today, the HGA-designed student services center allows the campus to better serve its student population by creating a space that is accessible, clear in organization and open to promote social connectivity. More.\n\nThis post comes courtesy of our ?make a guest post? page. Got a great lead, product find or idea? Share yours and it could make it on the 2Modern blog!"},{"articleId":"14304","title":"A Utopian dream","source":"The Hindu","articleLink":"http://www.thehindu.com/arts/cinema/article3266066.ece","displayContent":"From the stable of Ramana Communications comes Mudhalvar Mahatma, a new endeavour from the team that produced Kamaraj. And wielding the megaphone once again is A. Balakrishnan. Recently Mudhalvar Mahatma (MM) created quite a stir when Anna Hazare watched the film, his first in 40 years. Earlier, Kamaraj won the Tamil Nadu State Award for Best Film, besides a Special Commendation. The subject this time could garner more such honours.\n\nMM opens with slices of the Mahatma's life till his last day, when he was assassinated. Interwoven with a couple of incidents that show his unhappiness at the turn of events post-Independence, the first 15 minutes or so touch upon the Partition and other such significant happenings, and culminate in ?Hey! Ram!' the last words of the leader. Soon Gandhiji re-enters the world as Mohandas to serve the poor and downtrodden. He still looks the same ? the pair of glasses is intact. But instead of the dhoti, it is khaki that he sports.\n\nThe avarice of leaders and the led, the money-for-vote scams and corruption at all levels shock him. Ironically, he notices that Gandhiji is remembered in ever so many ways, but the values he stood for aren't.\n\nThe meeting between LTTE Supremo Prabhakaran and Mohandas, and their discussion on non-violence is a tightrope walk. Balakrishnan has handled it with caution. But the purpose beats you. The two don't discuss anything concrete. Neither does Mohandas offer any practical advice to Prabhakaran. So the scene ends up looking disjointed and contrived.\n\nMM is more a documentary ? at best a feature-linked presentation. And it has its share of gaffes. Yet it goes far beyond the call of the commercial. Its message is strong and the values it imparts are essential in today's world of malice and malpractice in every stratum. So it probably isn't fair to treat or rate MM as you would a regular film.\n\nThe narration of MM is from the point of view of a Chief Minister of a Utopian State, who practises the simple life he advocates. His people can never be veered from the path of ethics and righteousness. As a young man, the CM had spent his life serving Mohandas and through him, society as a whole. Only much later does he realise that Mohandas is Gandhiji himself! Ilaiyaraja's RR is an asset of MM.\n\nAs far as the premise of Gandhi re-appearing on the Earth goes, MM reminds you of Lage Raho Munnabhai, though Sanjay Dutt's rendezvous with the Father of the Nation was on subliminal lines.\n\nAnupam Kher plays the part of the Chief Minister. He has little to do, but the soft, serene look becomes him. Kanakaraj is Mohandas. His resemblance to Gandhiji is noticeable, and as an actor he makes a significant contribution. Also, because of the scope the character offers Kanakaraj shines brighter than Munnabhai's Gandhi, Dilip Prabhavalkar.\n\nThe title is confounding. Does it mean the CM is being seen as a Mahatma because of his simple life and blemish-less administration? But beyond that Balakrishnan's fantasy is more about stark realities.\n\nAt the end of it all, if your surmise is that the dishonesty and the greed of both politicians and the public would disillusion Gandhiji, they don't. Despite a completely flawed system and fraudulence on an epidemic scale, he wishes to stay back and serve the country. The mindset of Balakrishnan's MM remains unfathomable!"},{"articleId":"13497","title":"3: Three's a crowd","source":"The Hindu","articleLink":"http://www.thehindu.com/arts/cinema/article3266049.ece","displayContent":"The opening sequence in 3 (U) that shows a shocked heroine and a shattered family around a coffin, seems to assure the viewer of a suspense-filled story and an unusual denouement. Blossoming in adolescence and continuing steadfastly in adulthood, love in 3 is fresh.\n\nThe screenplay that deftly oscillates between the past and the present will sustain your interest throughout, you assume. The thriller-like treatment to a love story is bound to be engaging, you think. With witty dialogue further increasing expectation at this juncture, your joy increases manifold because another young woman has entered a predominantly male bastion and is making her presence felt. ?Hurray' to writer-director Aishwarya R. Dhanush, you wish to holler out! But the enthusiasm that continues till the intermission is at a low ebb soon after.\n\nAishwarya has worked under Selvaraghavan ? the influence shows. Bearing marked similarities to Kaadhal Kondain and Mayakkam Enna, originality takes a beating in the second half of 3. And as it is Dhanush who dons the role in all the three, the portrayal looks repetitive. Towards the end, you feel the protraction even more.\n\nFor Janani (Shruti Haasan) and Ram (Dhanush), romance transcends the stereotypical and reaches a crescendo that plateaus into marital bliss. The couple sees a decade of happy togetherness, when suddenly their castle of love crumbles. How and why, is what 3 is all about.\n\nAs a student of Class XII, Dhanush fills the bill. The look transports you to his Thulluvadho Ilamai days. And portraying the ardent lover or the busy businessman with a complex side to his character is child's play to him, as 3 proves. Only that it gives a sense of déjà vu. The Haasan girl is a beauty. She scores in the romantic interludes, and her eyes are like wells of agony when she wallows in sorrow, though when it comes to wailing in misery she can do better. Shruti has the potential to fly high.\n\nSundar Ramu as Senthil, the hero's loyal friend and confidant, is a crucial character in the film. 3 offers him more scope than Mayakkam Enna did and he utilises it well. Sundar's performance should take him places. However, in the etching of this character Aishwarya slips. When he first realises that his pal has a problem, his approach is so obviously wrong. Also he keeps talking only about the wife, but doesn't even think about taking the hero's dad into confidence! Incidentally, Prabhu, veteran that he is, stands apart, though it's a not-too-significant role.\n\nSivakarthikeyan has all the makings of a sensible comedian. His apt asides tickle the funny bone. Just about three scenes for Banupriya? Not fair at all! Comparatively, Rohini has more to do and she does it well. Kudos to Aishwarya's casting abilities as a whole.\n\nHer narration of a beautiful love story is flawless. Kola Bhaskar's editing skill also comes to the fore here. Eschewing jigs and duets in public places, she keeps matters slick and realistic. But when after a point, she has to stop the smooth romantic flow and bring in some drama she gets stuck. So like many of our makers she takes the pedestrian route of medical jargon, and abnormal conditions, physical and psychological. Melodrama sets in and tempo goes for a toss. By the time the plot is entirely unravelled, you get restless.\n\nAfter the ?Kolaveri Di' mania, it is blasphemy to forget Anirudh, the composer. Strangely, there's nothing new about the way the sequence has been shot. In fact, it's his melodies and Velraj's camerawork in them that leave a lasting impression. At the end, Aishwarya flashes a message about death. ?Confide in the wife, life will be good' would have been more relevant.\n\nStoryline: Calf love, joys of marriage and the misery round the corner ?\n\nBottomline: It's about three stages of life ? the third tests your patience a tad too much"},{"articleId":"12885","title":"Campus chat: ?Colouring the classics?","source":"The Hindu","articleLink":"http://www.thehindu.com/arts/cinema/article3262225.ece","displayContent":"Flawed, yet celebrated Karnan is one character from the Mahabharata that endears itself to most of us. Portrayed through the majestic gait and distinctive dialogue delivery of Sivaji Ganesan, Karnan was immortalised. Or so we thought. With a damaged audio track and an equally fragile audience memory, Karnan needed careful reviving.\n\nScreened this time at par with its contemporaries, the film came complete with theatrical trailers to evoke curiosity among the younger generations, and create a sense of nostalgia in the original fan's heart. ?It?s a great idea it can bring to the theatres those who had stopped watching films, because they could no longer identify with the subjects,? says G. Arun, whose parents still listen to audio versions of movies like Saraswathi Sabadham, Thirumal Perumai, and Thiruvilayadal. While the rest of the group felt that the re-entry of Karnan could be a trend setting event, S. Bhuwaneswari seemed to think, ?the interest would peter out long before this could be tagged a trend.?\n\nThe group, which debated upon movie casts and what exactly happened in particular scenes, thought that lengthy old movies with their many songs could be the reason why the trend might not hold up.\n\nS. KANAGASUNDARI, M.Phil. Library Science: ?I would like to see the film ?Chitti? being revamped like Karnan. The actors Padmini, M. R. Radha and Muthuraman have portrayed the emotions so naturally and the movie is full of great songs, especially, ?Kaalam Idhu?. The amazing story line and a brilliant actor like Padmini completely justify a re-release. Also, the colour film will further enhance the beauty of Padmini.?\n\nPRASAD SINH A.DALWI, M. tech. Geographic Information Systems: ?If Raja Harishchandra, the first full-length feature film in India, could be brought back, it would be a great revelation. Though a silent movie, its story has a resonance in today?s circumstances as well and I would want to see how the very first Indian production appeared in colour. With the story being so popular throughout the country, it?s bound to draw the crowds.?\n\nH. JERALTINE VENCY, Ph.D. Educational Technology: ?For the sheer strength of its dialogues, symbolism and values, ?Iru Kodugal? directed by K. Balachander should be brought back. The story, which revolves around a man, his present wife and his former wife, explores the emotionally charged setting. Things like office gossip have been dealt with great subtlety, reflected in the drawings of a child. The scene where Jayanthi responds to her husband Gemini Ganesan with a single word ?acha? is my personal favourite.?\n\nB. ANANDHASANKAR, MBA (Financial Management): ?I wish they would restore ?Edhir Neechal?, for the simple reason that it showcases the flawed human nature with such ease. Being a K.B. fan, I think this is one of his classics that project the importance of education and the greed of fellowmen. The film, which thrives on the extremely believable acting of Nagesh, Muthuraman and Jayanthi, has some great songs as well.?\n\nS. BHUVANESWARI, Ph.D. English Literature: ?Though I am not a great fan of the climax in ?Nenjil? Or Aalayam?, where a doctor dies trying to save his patient, the movie would definitely make a popular comeback. As a film that has been entirely shot within the confines of a hospital, it makes up for the lack in visual variety through the believable acting by Devika and the beautiful song ?Sonnadhu Nee Dhaana?.?\n\nG. Arun, Integrated M. Tech Remote Sensing: ?I am a huge fan of Sivaji Ganesan and if his ?Navarathiri? would be restored, it would make for such an interesting watch. The entire film is anchored by Sivaji?s distinct portrayal of the nine different characters encountered by Savithiri. In fact, I would be there at the theatre whenever a Sivaji movie gets restored like ?Karnan?.\n\nWell past its silver jubilee year, the Bharathidasan University was initially spread over 1,000 acres. Over the years, educational institutions like the Anna University, Indian Institute of Management, Trichy and the Bharathidasan Insitute of Manangement were allocated land from this sprawling acreage. The university trains its focus on research activities and at the moment has over a 100 ongoing research projects. Bharathidasan University, which covers Tiruchi, Pudukottai, Karur, Perambalur, Ariyalur, Thanjavur, Tiruvarur and Nagapattinam, has 123 affliliated colleges. Recently, the university has established four constituent colleges."},{"articleId":"9584","title":"Sites of the Week #198","source":"NotCot","articleLink":"http://feedproxy.google.com/~r/abduzeedo/~3/lc2qrMTA0sA/sites-week-198","displayContent":"You can keep sending me your suggestions via Twitter twitter.com/FabianoMe or twitter.com/abduzeedo, and include #abdz_sites in the message.\n\nIn 2012 if you don't believe you won't make it happen! - Happy New Year from the Soleil Noir team!\n\nHelloFax is an online fax and electronic signature service. You can upload documents, add your signature and other text to them, and then fax them for free. We also support email-to-fax and allow you to receive faxes.\n\nDollar Shave Club couldn't be simpler. Select one of our great razors, pay one low monthly fee, and we send 'em right to your door.\n\nOnline magazine about behavior, art, music, events and more. Its daily dose of random content of good quality.\n\nThe Blind Barber is a return to the \"Roaring Twenties\". Defined by the explosion of culture and its break from tradition, the \"Roaring Twenties\" was a movement in creativity.\n\nThere are all kinds of things that we believe set redpepper apart from the crowd ? our culture, our process, our passion for creating remarkable and measurable work. But behind all of these elements is one common denominator: our people.\n\nWe?re a group of creative professionals with a passion for usability and web design, located in Springfield, Missouri.\n\nSMPL is a robust, responsive business theme with a clean, modular design. With integrated styling for WooCommerce you can enable e-commerce shop facilities out of the box, or enable later with the re-assurance that your site can scale with your business?s growth.\n\nAppMaker Showcase is a professionally designed theme including many features to help you to promote and sell your iPhone app, Android or Windows Phone application."},{"articleId":"282","title":"Beautiful Houses: River Bank House in Montana","source":"NotCot","articleLink":"http://feedproxy.google.com/~r/abduzeedo/~3/F3oxZfVNd_A/beautiful-houses-river-bank-house-montana","displayContent":"The River Bank is a project by Balance Associates Architects. The house sits along the Gallatin River just outside Big Sky, Montana, USA. Since the clients love to entertain the house was set up to create an open and casual atmosphere, besides offering a strong connection to the outdoors. The large roof over the living room serves to shade large areas of glass in the summer, while geothermal heat pumps and high levels of insulation help keep it warm and energy efficient in the winter. The house also counts with two wings to capture the best views of the river and create a protected entry courtyard.\n\nIn my opinion this is the perfect \"mountain house.\" The use of wood, the huge glass windows, the amazing view... everything here creates a nice and cozy mountain retreat. A great place to enjoy the nature counting with comfort and style. Definitely a great place to live! ;)\n\nCheck out Balance Associates Architects website for further details about this and other projects. See you next time.\n\nWe found this house at ArchDaily."},{"articleId":"64","title":"The Titanic: High tech?s failure in 1912 ","source":"The Hindu","articleLink":"http://www.thehindu.com/news/international/article3260950.ece","displayContent":"Fierce competition in the shipping industry and the belief that technology could conquer all led 100 years ago to one of the greatest disasters in seafaring history: the sinking of the Titanic.\n\nOn its maiden voyage from Southampton, England, to New York, the steamer rammed into an iceberg late on April 14, 1912, and sank in just over two hours.\n\nRecord Size: At its initial launch in 1911, the Titanic was the world?s biggest ship ? 269 metres long, 28 metres wide and 53 metres high, with 51,000 horsepower. The construction cost 10 million dollars, the equivalent of 213 million dollars today. Its owner, British shipping company White Star Line, did not invest in an alarm system ? the Titanic was considered unsinkable.\n\nLuxury Steamer: Luxurious first-class furnishings were especially important to the owner. Only millionaires of the time could afford the 4,400-dollar suite ? around 93,000 dollars today.\n\nPassengers: Since the sinking of the Titanic, passenger counts have varied. The British Parliament in 1912 put the number of passengers on board at 2,224, including 900 crew members. Of that number, 711 people were rescued and 1,513 died.\n\nLifeboats: The Titanic carried 20 lifeboats, enough for 1,200 people. The number was calculated not according to passenger numbers, but rather according to the boat?s weight. The owner could have reduced that number even more if it had wanted to.\n\nShortcomings: Sailors on watch had no telescopes ? and therefore saw the iceberg too late. Despite warnings from other ships about ice in the region, the captain did not order additional watches. In the evacuation, several officers interpreted the standing order of ?women and children first? to mean ?only women and children.? Several lifeboats were thus lowered half empty into the water. With no alarm system, the lower decks could not be alerted to the impending disaster, leading to an especially high death toll among third-class passengers.\n\nThe Sinking: The Titanic scraped the iceberg at 23.40 April 14, ship?s time, and sank by 02.20 on April 15. The ship?s band continued playing as ordered until the last minute, and all of them died.\n\nThe Rescue: The SS Californian was nearest the disaster site, but its captain did not receive the cry for help because his radio officer was off duty and sleeping. The first ship to reach the Titanic survivors was the RMS Carpathia, at about 04.00, by which time passengers who had jumped into the water had frozen to death.\n\nThe Wreck: The remains of the Titanic were first sighted on September 1, 1985, at 3,800 metres of depth, about 22 kilometres from the position given by the Titanic in its calls for help.\n\nLast Survivor: Millvina Dean, one of two babies on board the ship, died on May 31, 2009, the last survivor of the Titanic."}]
