[{"articleId":"20891","title":"Fancy Hands' On-Call Army Of Personal Assistants Log 20,000 Minutes Of Talk Time Per Month","source":"Fast Company","articleLink":"http://feedproxy.google.com/~r/fastcompany/headlines/~3/ENwSKQs1qsk/fancy-hands-ted-roden-personal-assistants","displayContent":"You don't have to be a Hollywood mogul to have someone do mind-numbing tasks for you. Just ask Ted Roden.\n\nThree years ago, Ted Roden was sitting in a maternity ward with his wife and newborn baby when he came to a realization. Between his full-time job as aNew York Times developer, the book he was writing, and his family, when would he ever again find time for the small yet necessary tasks of everyday life like booking a dinner reservation? Or paying his electric bill? Or scheduling a phone call with this reporter?\n\nThat?s when Roden came up with the idea for Fancy Hands, a team of personal assistants that helps you accomplish the kinds of basic tasks anybody can do, so you have more time to do the things only you can do. For example, Fancy Hands can?t write this article for me, but they can do all the things that might be keeping me from writing it, like calling the cable company or scheduling a dentist appointment.\n\n?The idea came totally out of a need,? says Roden, who was Fancy Hands? only user for the first six months of its quiet launch back in April 2010. Spoken like a true developer, he adds, ?Rather than make a simple phone call to take my wife out to dinner, I built an elaborate platform.?\n\nTransforming the idea from a personal pet project into a business only made sense, considering the outsized levels of productivity people strive for today. And the transition itself went fairly smoothly, as Roden had worked for a startup before (he was one of the first programmers at Vimeo, back when ?you had to explain to people what Vimeo was?), and the way Fancy Hands makes money is pretty straightforward. ?It?s a very complicated system underneath, but business-wise it?s very simple. People pay us, we do things.? Participants pay a monthly fee depending on the plan--$25 will get you 5 requests a month, while $65 will get you up to 25 requests.\n\nThe bigger challenge was, and continues to be, convincing consumers that you don?t have to be a Hollywood mogul or a corporate fatcat to reap the benefits of a personal assistant. ?Delegating is hard,\" Roden says. \"Even if you give someone a real assistant sitting next to them, it?s going to be a while before they figure out anything to give them. We try to demonstrate to people how there?s so much you have to do in a given day, but only so much you have to do yourself.\"\n\nWe try to demonstrate to people how there?s so much you have to do in a given day, but only so much you have to do yourself.\n\nWhile Roden is coy about the specific number of requests Fancy Hands handles daily, he says that during January and February of this year, his assistants logged over 40,000 minutes on the phone for his clients--that?s about a full month straight of talk-time. And phone jobs don?t even make up the majority of Fancy Hands? work; most requests involve emailing, proofreading, and research.\n\nOne major thing Fancy Hands hasn?t had the infrastructure to support yet is the ability to pay for things on people?s behalf. But that?s all about to change in the coming days and months, Roden says. Another new feature Fancy Hands plans to launch this year is a pricing plan for companies who want to make Fancy Hands? assistants available to its employees during business hours.\n\n?This is going to be a make-or-break year for us without question. We?re either killing it this time next year or we probably don?t exist.\"\n\nIn the future, Roden hopes that completing ?mind-numbing? tasks will become such an automated process that people will forget how they ever completed them in the past. He compares it to how digital immigrants of a certain age may forget how they ever bought airline tickets before the Internet came along. But until the day that technology can take care of all these annoying duties for us, Fancy Hands? assistants are here to help."},{"articleId":"19255","title":"Michaels Stores Joins IPO Bandwagon","source":"WSJ.com","articleLink":"http://feeds.wsjonline.com/~r/wsj/xml/rss/3_7011/~3/YJ2p2nJXMZU/SB10001424052702303816504577313613891517998.html","displayContent":"Arts-and-crafts retailer Michaels Stores Inc. filed plans to return to public ownership, potentially enabling its private-equity owners to double their investment amid a receptive market for new stocks and growth in sales and stores at the chain.\n\nThe retailer, a staple of suburban shopping centers, was taken private by a group led by private-equity firms Blackstone Group LP and Bain Capital LLC in late 2006 amid a buyout boom. In many ways the Irving, Texas, company will return to public shareholders larger and more profitable, a profile that contrasts with several other companies taken private that then struggled under the debt the buyout deals piled upon them.\n\nMichaels's buyers, which included management, paid about $6 billion for the company, using about $1.8 billion in cash and equity and tapping debt markets and Michaels's coffers for the remainder. Since then, the chain, which attracts enthusiasts of activities such as scrapbooking, floral arranging and knitting, has added about 160 stores, for a total of 1,064, and some 2,200 employees and has boosted revenue and profit.\n\nThough Michaels has trimmed its debt from a high of nearly $4.3 billion after the buyout, it continues to carry nearly $3.4 billion in long-term debt compared with none at the time it was taken private.\n\nThe filing Friday comes as investors lately have shown an appetite for initial public offerings, a move that can help private-equity firms lay the groundwork to cash out on investments. Since the financial crisis, some firms have struggled to sell companies in their portfolios.\n\nWere Michaels to fetch a valuation similar to some other specialty retailers, about 10 times earnings before interest, taxes, depreciation and amortization, its private-equity backers could double their investment. However, a successful deal would depend on market response and the firms would only hold paper profits until their stakes are sold.\n\nThis year, shares of private-equity- and venture-capital-backed firms have outperformed those of other companies that have gone public, research shows. Through Tuesday, shares of such companies had risen 45% from their initial offering price compared with 8% for other companies, according to BMO Capital Markets. On Thursday, private-equity-backed mobile-advertising provider Millennial Media Inc.'s shares leapt 92% after hitting the market, the best first day for a new stock since May. On Friday, Millennial's stock fell $1.50, or 6%, to $23.50.\n\nMichaels said Friday in a Securities and Exchange Commission filing that it planned to raise $500 million in the stock offering, though that number likely will change as the sale approaches. J.P. Morgan Chase & Co. and Goldman Sachs Group Inc. have been hired to lead the offering, in which other banks also will play a role.\n\nMichaels said it intends to use proceeds of the stock offering to pay off some of its most-expensive debt.\n\nThe investors won't be collecting any proceeds from the stock offering, the filing said. Blackstone, Bain and another investor, Highfields Capital Partners, have together collected more than $125 million from Michaels in management and transaction fees since the buyout, the filing said. It also said Michaels expects to pay the three firms a termination fee based on the remaining value of a 10-year management agreement. That fee likely will exceed $50 million.\n\nMichaels's earnings before interest, taxes, depreciation and amortization were a company record of $706 million for the fiscal year ended Jan. 28, up 14% from $622 million the year before and $324 million the year it was taken private.\n\nFounded in Dallas in 1976 by Michael J. Dupey, the chain expanded rapidly after Dallas brothers Sam and Charles Wyly purchased it in 1982 and took it public two years later.\n\nMichaels is the largest purveyor of arts-and-crafts supplies in North America by sales and also owns 134 Aaron Brothers stores. It plans to spend up to $160 million opening 50 new stores this year.\n\nIn 2006, Blackstone and Bain took the company private, paying $44 a share, a 30% premium over Michaels's market price. The chain began to remodel its stodgy stores and added crafts classes, but posted uneven earnings as an increase in craft sales were offset by stagnant sales of silk flowers and other home furnishings amid the collapse in the housing market.\n\nIn March 2009, Michaels named John Menzer as chief executive. Mr. Menzer previously had served in a variety of roles at Wal-Mart Stores Inc., including vice chairman of its U.S. stores.\n\nMr. Menzer cut expenses, instituted better inventory control and encouraged buyers to hunt for exclusive lines. The chain notched a hit with an exclusive line of crafts from Mattel Inc.'s American Girl. Digital advertising also was stressed.\n\nTaking advantage of depressed real-estate prices and store closings, Michaels recently began opening about 40 new stores a year. About a quarter of them are smaller than its traditional stores and targeted to rural and urban areas. Michaels opened its first Manhattan store in 2009.\n\n\"It was very well organized,\" said Graisky Ramos, outside of the store Thursday night. It had been years since she had been in one of the stores. She recalled items then being hard to find and customer service lacking. In the Manhattan store, in contrast, \"I found everything I needed and the staff was very friendly.\"\n\nMichaels's biggest rivals are Hobby Lobby Inc. and Jo-Ann Stores Inc., which each post about $2 billion in yearly revenue, analysts estimate. Oklahoma City-based Hobby Lobby has been expanding rapidly into new markets and now has more than 500 stores. Jo-Ann's, which specializes in fabric and sewing items and has more than 750 stores, was taken private in 2010 by Leonard Green & Partners LP.\n\nWrite to Ryan Dezember at ryan.dezember@dowjones.com and Ann Zimmerman at ann.zimmerman@wsj.com\n\nA version of this article appeared Mar. 31, 2012, on page B1 in some U.S. editions of The Wall Street Journal, with the headline: Bye Bye Buyout: Michaels Stores Jumps Onto IPO Bandwagon."},{"articleId":"18791","title":"EU Urges IMF to Boost Support","source":"WSJ.com","articleLink":"http://feeds.wsjonline.com/~r/wsj/xml/rss/3_7011/~3/5C8zXvnaSQk/SB10001424052702304177104577315450457811144.html","displayContent":"Dow Jones Reprints: This copy is for your personal, non-commercial use only. To order presentation-ready copies for distribution to your colleagues, clients or customers, use the Order Reprints tool at the bottom of any article or visit www.djreprints.com\n\nCOPENHAGEN?European finance ministers urged a prompt decision on ramping up the International Monetary Fund's crisis-fighting resources, a day after they agreed to commit more funds to their own so-called firewall.\n\nAfter two days of talks on efforts to enhance their response to the sovereign-debt crisis, finance ministers from the 27 member nations of the European Union and central bank governors said that despite signs of stability and easing tensions in the financial markets there shouldn't be complacency.\n\nDanish economy minister Margrethe Vestager, who hosted the talks, said on Saturday that it is crucial that a global agreement is reached on ..."},{"articleId":"18789","title":"Way Cleared for Alaska Gas Pipeline","source":"WSJ.com","articleLink":"http://feeds.wsjonline.com/~r/wsj/xml/rss/3_7011/~3/Fj-vdiO8zjE/SB10001424052702303816504577313703552129434.html","displayContent":"Dow Jones Reprints: This copy is for your personal, non-commercial use only. To order presentation-ready copies for distribution to your colleagues, clients or customers, use the Order Reprints tool at the bottom of any article or visit www.djreprints.com\n\nExxon Mobil Corp., BP PLC and ConocoPhillips settled a long-running dispute with Alaska that paves the way for a pipeline project to ship natural gas from the North Slope, unleashing the state's massive gas reserves.\n\nThe settlement between the state and the companies lets them keep their leases in the Point Thomson field, located east of the huge Prudhoe Bay field, in exchange for the promise to begin production by May 2016 at the latest.\n\nSettling the Point Thomson dispute?where the state took away leases from the companies because of limited drilling activity?was considered a key to the future pipeline ..."},{"articleId":"18533","title":"Sirius Moves to Block Liberty","source":"WSJ.com","articleLink":"http://feeds.wsjonline.com/~r/wsj/xml/rss/3_7011/~3/74J6cWlNnmo/SB10001424052702303404704577315522428911932.html","displayContent":"Dow Jones Reprints: This copy is for your personal, non-commercial use only. To order presentation-ready copies for distribution to your colleagues, clients or customers, use the Order Reprints tool at the bottom of any article or visit www.djreprints.com\n\nSirius XM Radio is trying to block what could be the first move by Liberty Media Corp. to gain control of the satellite broadcaster.\n\nLiberty, which has preferred stock convertible into 40% of Sirius shares, has asked the Federal Communications Commission for permission to take \"de facto\" control of the satellite broadcaster, Sirius revealed in an FCC filing on Friday.\n\nSirius has asked the FCC to \"dismiss or deny\" the application.\n\nLiberty's move signals it is at least keeping its options open on lifting its stake in Sirius. If Liberty wins ..."},{"articleId":"17110","title":"Sirius Moves to Block Control by Liberty Media","source":"WSJ.com","articleLink":"http://feeds.wsjonline.com/~r/wsj/xml/rss/3_7011/~3/74J6cWlNnmo/SB10001424052702303404704577315522428911932.html","displayContent":"Dow Jones Reprints: This copy is for your personal, non-commercial use only. To order presentation-ready copies for distribution to your colleagues, clients or customers, use the Order Reprints tool at the bottom of any article or visit www.djreprints.com\n\nSirius XM Radio is trying to block what could be the first move by Liberty Media Corp. to gain control of the satellite broadcaster.\n\nLiberty, which has preferred stock convertible into 40% of Sirius shares, has asked the Federal Communications Commission for permission to take \"de facto\" control of the satellite broadcaster, Sirius revealed in an FCC filing on Friday.\n\nSirius has asked the FCC to \"dismiss or deny\" the application.\n\nLiberty's move signals it is at least keeping its options open on lifting its stake in Sirius. If Liberty wins ..."},{"articleId":"13922","title":"Top 10 Most Popular Stories Of The Week","source":"Fast Company","articleLink":"http://feedproxy.google.com/~r/fastcompany/headlines/~3/LOeXcqhlHxY/top-10-most-popular-stories-of-the-week","displayContent":"Here are the stories you read, shared, tweeted, and pinned this week.\n\nThis week?s stories primarily focused on charisma, creativity, breaking norms in the workplace, and stunning design. You will find some great advice and varying perspectives in the articles below. Enjoy.\n\n2. Cultivating Charisma: How Personal Magnetism Can Help (Or Hurt) You At Work Fast Company Olivia Fox Cabane dissects charisma and analyzes its influence on the human psyche. Definitely a must-read.\n\n3. Desks, Where Creativity Goes To Die Fast Company Emily Heyword offers some helpful advice on how to break your routine to increase creativity and innovation.\n\n4. The No-Hour Workweek: Reinventing Employee Expectations For The Modern Economy Co.Exist Jon Stein calls for change in how the modern workweek is constructed. Read on to find out how a good company should treat you.\n\n5. Tooth Tattoos Will Tell When You?re Ill Co.Exist Nidhi Subbaraman reports on tooth tattoos that could change the way we detect and prevent sickness.\n\nJust as the world learns about \"pink slime,\" this infographic makes you think again about going for that double burger.\n\nCliff Kuang highlights some clever tricks Google has used to trick employees into eating better.\n\n9. Better Than A Van Gogh: NASA Visualizes All The World?s Ocean Currents Co.Design Check out NASA?s enthralling visualization of the ocean?s surface current flow.\n\n10. Warm Showers, Friction, And Failure: Jonah Lehrer On The Keys To Creativity Co.Create Teressa Iezzi talks to Jonah Lehrer on how to increase your creativity.\n\nVideo Of The Week:How To SuperBetter Your Life With Epic Wins The Way Jane McGonigal Does Fast Company Amber Mac talks to Jane McGonigal on the benefits of games (they really exist)."},{"articleId":"13710","title":"Groupon Forced to Revise Results","source":"WSJ.com","articleLink":"http://feeds.wsjonline.com/~r/wsj/xml/rss/3_7011/~3/5ZEro1JKbEk/SB10001424052702303816504577313983768173826.html","displayContent":"Groupon Inc. is revising financial results it reported in its first quarter as a public company, after discovering executives failed to set aside enough money for customer refunds.\n\nThe popular online-coupon company's auditor, Ernst & Young, called the error a \"material weakness in its internal controls\" for 2011. Groupon shares, which have been trading below their $20 initial public offering price, sank 6% to $17.20 in after-hours trading.\n\nThe surprise announcement raised questions about the reliability of Groupon's numbers at a moment when it is trying to build confidence of Wall Street investors. It had reported a loss of $37 million for its fourth quarter. The accounting changes will reduce the company's revenue for the quarter by $14.3 million and widen its loss by $22.6 million, or 4 cents a share.\n\nGroupon has become a bellwether for a new generation of technology companies that, using technology, are able to build massive scale over short periods. Investors have been eager to buy into that growth potential?and have given Groupon a market capitalization of over $11 billion.\n\nBut Groupon has had to beat back concerns that it takes aggressive views on accounting, most prominently when last year it had to cut its reported revenue in half to satisfy questions from the Securities and Exchange Commission. One analyst dubbed the Chicago-based company an \"overgrown toddler.\"\n\nFriday's disclosures are likely to intensify investor worries about how Groupon conducts business, and whether its core operations are as strong as advertised, analysts said.\n\n\"We remain confident in the fundamentals of our business, as our performance continues to highlight the value that we provide to customers and merchants,\" Groupon Chief Financial Officer Jason Child said.\n\nGroupon offers discounted deals to its subscriber base, and then splits the value of the deal with the merchant that offered it. For a $10 purchase at a sandwich shop, for example, Groupon might take $5 and give the rest to the merchant. The company makes a point of telling users that refunds won't be a hassle.\n\nGroupon emphasizes something it calls \"the Groupon Promise,\" which means \"if the experience using your Groupon ever lets you down, we'll make it right or return your purchase.\" In many cases any unredeemed daily deal can be returned within the first seven days after it is purchased, the company says.\n\nAt the heart of the revision is the fact that Groupon had more customers seeking refunds than it expected. The reason, according to Groupon, was that it offered more high-price deals which generally lead to a higher volume of refunds.\n\nThe company also said the higher rate of refunds has persisted in the first quarter ending March 31, although the company reaffirmed its previous financial guidance for the period. It plans to report results for the first quarter on May 14.\n\nGroupon said it did not have \"adequate policies and procedures\" to review its estimates and assumptions.\n\nIn its filings, Groupon has noted that an inability to obtain reimbursements from merchant partners to cover customer claims \"could have an adverse effect on our liquidity and profitability.\"\n\nGroupon, which went public in November, reported in February an unexpected loss of $37 million on revenue $506.5 million for its fourth quarter?its first period as a public company. The news triggered a selloff in the stock as investors had expected the company to post a profit.\n\nGroupon's latest missteps, combined with its previous accounting issues, call into question whether the start-up was ready to be a public company that has to produce reliable financial reports, said Sandra Peters, head of financial reporting policy for the CFA Institute, which represents chartered financial analysts who work with individual investors.\n\n\"It really demonstrates, for an IPO, were they really ready to go?\" she said. \"Did they have the financial systems, did they have the processes and procedures in place?\"\n\nSimilar concerns were echoed by people who track the company on Wall Street. \"It's going to definitely unsettle a lot of investors,\" said Ken Sena, an analyst covering Groupon for Evercore Partners.\n\nGroupon's stumbles come as Congress advanced a bill, known as the Jobs Act, that would ease the regulatory burdens on fast-growing businesses.\n\nUnder the act, Groupon, which has less than $1 billion revenue, would qualify as an emerging growth company, entitled to immunity from annual audits of internal accounting controls.\n\nThe Jobs Act would loosen Groupon's duties \"over exactly the type of controls that it was deficient in,\" said John Coffee, a law professor at Columbia University.\n\nGroupon also might find itself in the cross hairs of SEC enforcement lawyers, who often launch probes following such disclosures to determine whether fraud or other deliberate violations occurred. A spokesperson for the SEC declined to comment Friday.\n\nRick Summers, a Morningstar analyst, said a revision isn't unheard of, but it is distressing the company didn't have its books in order. \"We're playing with the big boys now,\" he said. \"You can recover but it isn't altogether confidence inspiring.\"\n\nA version of this article appeared Mar. 31, 2012, on page A1 in some U.S. editions of The Wall Street Journal, with the headline: Groupon Forced To Revise Results."},{"articleId":"13496","title":"The Hidden Skills in Your Most Reliable People","source":"HBR.org","articleLink":"http://feeds.harvardbusiness.org/~r/harvardbusiness/~3/tq9PAZlvLjA/the_hidden_skills_in_your_most.html","displayContent":"Art Markman, PhD, is the Annabel Irion Worsham Centennial Professor of Psychology and Marketing at the University of Texas at Austin. He is currently editor of the journal Cognitive Science, and consults regularly through his company Maximizing Mind. Follow him on twitter @abmarkman.\n\nWhen you need something done ? and done right ? you probably know who you can count on. Even at work, most people have someone they can call on at a moment's notice.\n\nIf you gave your team a basic personality test, the reliable people would probably score high in conscientiousness, one of the five basic personality dimensions. It reflects how organized, disciplined, thorough, and careful someone tends to be. There are a few ways that we identify people as conscientious. Basic personality scales (often given by HR during hiring) will include a measure of conscientiousness. However, managers can usually determine someone's conscientiousness by their tendency to complete tasks without much supervision. Starting in the 1990's, organizational research has found that people displaying these traits tend to succeed in management roles.\n\nIt's important to note that conscientiousness is independent of agreeableness, which I talked in a previous post. People (particularly men) who are highly agreeable tend to have problems as managers, because they are not willing to say things that might upset the people around them. A person's level of conscientiousness does not predict their level of agreeableness, and vice versa.\n\nUnsurprisingly, conscientious people do make good managers. They make sure that things get done. They keep teams on track. They pay attention to little details that can spell the difference between success and failure. So, there is a tendency to get these folks on a management track early.\n\nSenior managers may hastily groom conscientious people for management, but these star performers often have many other skills ? technical expertise, innovative thinking, good communication, etc. The key dilemma here is that it can take several years to determine that someone has these skills. For example, technical expertise often influences a company behind-the-scenes. But, the company will not benefit from these other abilities when employees are put quickly on the management track.\n\nHere are three suggestions for keeping a closer eye on your conscientious employees, and helping develop their critical hidden skills:\n\nKeep track of their assignments. Make sure that you are not loading them up with extra tasks just because you know that they will take care of them.\n\nReward them. If you have overloaded your conscientious folks, reward them with some time and space to work on projects dear to them. That autonomy and appreciation strengthens their bond to the company. It also provides you with more opportunities to observe where their greatest contributions to the organization may lie.\n\nGet a broad picture of their skills. Before moving them to the management track, give your conscientious employees a chance to display all of their strengths. Consider characteristics that might make someone successful in other core areas, like research and innovation settings. For example, people with a wide base of knowledge who are highly open to new experiences (another core personality trait) are often successful as innovators. Those people will not have much opportunity to serve in innovation capacities if they are first brought into management.\n\nRemember: Don't rush anyone into management based on how conscientious they are, which is fairly easy to see. Some of the other abilities may be harder to observe. Give yourself a little more time to get to know what people can do well. This way, you'll allow them to not only demonstrate how reliable they are, but all the ways they can contribute to your company."},{"articleId":"12846","title":"U.S. Stocks Nearly Flat","source":"WSJ.com","articleLink":"http://feeds.wsjonline.com/~r/wsj/xml/rss/3_7011/~3/ZVF3Cuk1E-0/SB10001424052702303816504577313123753822852.html","displayContent":"NEW YORK?U.S. stocks traded nearly flat as euro-zone leaders neared a bailout agreement and following signs of strength in the American consumer, as the market was on course to post its biggest quarterly advance in more than a decade.\n\nThe Dow Jones Industrial Average gained 7 points, or 0.1%, to 13152. Blue chips have gained more than 900 points this year, putting the benchmark on course for its biggest first-quarter point gain in history, as well as the best first-quarter percentage gain since 1998.\n\nThe Standard & Poor's 500-stock index fell one point, or 0.1%, to 1402, and is set to notch it biggest quarterly advance in more than a decade. The Nasdaq Composite fell 15, or 0.5%, to 3081.\n\nHealth care and consumer-staple stocks led the market's gains, as stocks like Pfizer rose 1% and Johnson & Johnson rose 0.4%. Technology stocks lagged behind, weighing down the Nasdaq, with Apple down 1.6% and Micron Technology down 3.2%.\n\n\"The market is looking for a level to grind higher,\" said Ben Schwartz chief market strategist at Lightspeed Financial in Chicago. \"Overall, you've had some movement, but we have big imbalances at the end of this quarter,\"\n\nThe first-quarter's stock advance has coincided with light traffic on equity exchanges. Average daily stock-trading volume on the New York Stock Exchange is on pace to be the lowest since 2007, while volume on the Nasdaq Stock Market is likely to be the thinnest since 2006.\n\n\"You can run around and say it's been a big move in the Dow, but the reality is that people have not really participated. If you don't have more participation, we're going to trade in a range and start to flop around,\" Schwartz said.\n\nStocks opened higher, then eased off session highs following a mixed bag of U.S. economic data. Before the opening bell, data showed U.S. consumers increased spending in February even as incomes rose modestly. Personal spending jumped 0.8% last month, the best gain since July, while incomes increased 0.2%. Economists surveyed by Dow Jones Newswires were expecting spending to grow 0.6% last month and incomes to rise 0.4%.\n\nA reading on March manufacturing activity in the Chicago area came in slightly lower than expected. The Chicago purchasing managers index was 62.2, lower than forecasts for 63, and down from February's reading of 64 .\n\nMinutes later, a March reading on the Reuters/University of Michigan consumer-sentiment index came in better than expected, at 76.2, versus expectations for 74.5.\n\nEuropean markets were broadly higher, as investors expressed relief that the euro-zone finance ministers agreed to increase the size of the region's capacity for crisis lending to ?700 billion. The Stoxx Europe 600 rose 0.9% and was set to snap a three-session losing streak.\n\nThe euro-area finance ministers said they may engage in new programs for a transitional period until mid-2013, when the fund will be capped at ?500 billion.\n\nRobust retail sales in February data from France also buoyed investor sentiment.\n\nStill, Greek Prime Minister Lucas Papademos introduced some uncertainty after saying that a third bailout for the country couldn't be completely ruled out.\n\nAsian bourses ended mostly lower, with Japan's Nikkei Stock Average shedding 0.3% and Australia's S&P/ASX 200 losing 0.1%, while China's Shanghai Composite bucked the trend with a 0.5% gain.\n\nCrude-oil futures rose 0.4% to $103.14 a barrel, while gold futures tacked on 0.6% to $1,664.50 a troy ounce. The U.S. dollar lost ground against the euro and was flat against the yen. The yield on 10-year U.S. Treasury bonds fell to 2.156%.\n\nIn corporate news, shares of Research in Motion rose 0.7% after the company reported a $125 million loss in its fiscal fourth quarter and announced a series of high-level departures.\n\nFinish Line slumped 14% after the athletic-shoe retailer reported fiscal fourth-quarter revenue that topped estimates but earnings that were just in line, and provided an earnings-growth outlook for the current year that was below forecasts.\n\nImmunoGen jumped 9.1% after drug partner Roche Holding AG reported positive results from a late-stage study of its experimental breast-cancer drug T-DM1, paving the way to file the potential blockbuster drug for regulatory approval in Europe and the U.S. later this year.\n\nThreshold Pharmaceuticals rose 4.3% after the company said the U.S. Food and Drug Administration granted orphan drug status for its treatment for soft tissue sarcoma."}]
