[{"articleId":"18136","title":"Week in Review: Hunger Games Stars Battle Racism, Khloé Quits PETA for Kim, Miley & Liam Ring Rumors","source":"E! Online","articleLink":"http://feeds.eonline.com/~r/eonline/topstories/~3/Kq0U18hkXP4/305030","displayContent":"After a week like the last one, you just gotta pick yourself up and dust yourself off.\n\nLuckily, there was plenty of all new news to relish this week in addition to the floury fallout from a certain reality star's misadventure on the red carpet.\n\nFeel free to dig in and enjoy!\n\nVOTE: Our Ultimate Fan Battle is down to the final two?plus, it's time to vote in a wild card\n\nBAD BLOOD: Amandla Stenberg, Lenny Kravitz and Dayo Okeniyi were the targets of some racially charged tweets directed at their roles in The Hunger Games. Being the class act that she is, onscreen and off, 13-year-old Amandla said simply that she remained honored and thrilled to be a part of the blockbuster film. And wewere thrilled to watch her, Lenny and Dayo play their roles perfectly.\n\nMORE: Josh Hutcherson Talks Hunger Games Sequel (Yes, Already)?Plus, What's He Texting Jennifer Lawrence?\n\nFUR REAL: Khloé Kardashian Odom stands up for sister Kim by quitting a defiant PETA after it turned out that she knew the sister of the woman who flour-bombed Kim (there's video footage to prove it) and strikes down divorce rumors. All in a week's work for Khloé!\n\nOVERTIME: While it was always ironic that it was going to take Kim Kardashian and Kris Humphries longer to get divorced than it took to plan a wedding and be married, it appears that Kris' side is holding up the proceedings with an eye on getting more money out of the deal. Now he wants a full accounting of any assets she acquired or let go of?donated wedding gifts included?during their 72-day union...In the meantime, Kim assured her fans that she didn't go rebounding with Eva Longoria's ex, Eduardo Cruz...And, happily, shemade it through per first post-flouring red carpet, the launch party for Valentino's new Beverly Hills flagship store, without incident.\n\nREAD: PETA Backs Khloé, Wishes She \"Had More Influence\" Over Kim\n\nCOPPERTONE GIRL: Kendall Jenner couldn't help but steal the swimsuit show this week with one bikini twitpic, just as her big sisters launched (and modeled) their new swimwear line for Sears.\n\nVAN DER BABY: James Van Der Beek and wife Kimberly welcomed a son they've so normally named Joshua.\n\nRING AROUND THE RUMOR: Miley Cyrus was rockin' a huge rock, leading the question of whether she and longtime beau Liam Hemsworth were engaged. Negatory, but that doesn't mean Liam's off kissing other girls like Teresa Palmer or anything. Well, he is, but the hottie doesn't only work for The Hunger Games.\n\nMORE: Did Miley Cyrus Flash a Huge Ring to Upstage Her Hunger Games Boyfriend?\n\nOCTONOT: Nadya \"Octomom\" Suleman posed topless and all-around nearly nude for...well, we're not quite sure yet?besides for money, that is.\n\nPOOR FORM: Kate Gosselin got dissed by her old Dancing With the Stars partner, Tony Dovolani. That's no way to treat a lady on her 37th birthday!...Hey, Tony lasted longer with Kate than he did with Martina Navratilova!\n\nBIRD BRAIN: Alicia Silverstone shocked and awed with a video that showed her feeding 10-month-old son Bear straight out of her own mouth.\n\nMORE: Alicia Silverstone, Eat Your Heart Out: Five More Famous Mothers Who Have Overshared\n\nTHE SPLITS: Peter Facinelli filed for divorce from Jennie Garth, who admits the breakup was Peter's idea...Bradley Cooper and Zoe Saldana have stopped seeing each other.\n\nSTILL AT IT: Peter Cook and Christie Brinkley are still taking public potshots at each other, nearly four years after divorcing. Makes sense?the kids are much older and can really pay attention to mom and dad fighting now.\n\nOFF-LEASH: Lindsay Lohan \"successfully\" completed probation! It's a Christmas miracle! One that she celebrated with a suite full of people at Chateau Marmont.\n\nMORE: Good Luck, Mariah Carey and Nick Cannon: Five A-List Couples Who Renewed Their Vows?and Then Split!\n\nWEDDING BELLS: Lake Bell is engaged to tattoo artist Scott Campbell...Raising Sextupletsmom Jenny Masche tied the knot with Levi McClendon, who now has six stepkids...Jerry Lee Lewis tied the knot for the seventh time...The Biggest Loser's Megan Stone engaged to boyfriend Michael.\n\nROMANTIC MUSINGS: Jason Segel and Michelle Williams? Could be happening...Katy Perry says she's single, but that doesn't mean she hasn't canoodled with Baptiste Giabiconi...Rihanna also insists she's single and not dating Ashton Kutcher...Jamie-Lynn Sigler is dating Washington Nationals player Cutter Dykstra...The Bachelor's Ben and Courtney have not moved in together yet...Joel Kinnaman took Olivia Munnto The Killing's season two premiere.\n\nBABY BOOM: Andrea Bocelli and fiancée Veronica Berti welcomed a daughter, Virginia...January Jones has been popping her-own-placenta pills since birthing baby Xander.\n\nLAW & DISORDER: Rob Kardashian detained but not arrested by Miami cops after a paparazzi scuffle...Amy Winehouse's $4.66 million estate went to her parents, Mitch and Janis...Spike Lee has agreed to compensate the elderly couple he inadvertently linked to Trayvon Martin's killing by tweeting their address, thinking it was the address of the guy who pulled the trigger, George Zimmerman...Geraldo Rivera faced fallout from his hoodie remark...Jaleel White, now a big hit on Dancing With the Stars, responds to allegations from an ex that he abused her...Gordon Ramsay settles lawsuit against London P.R. firm owner...Bobby Brown charged with DUI, swears he was just talking on the phone...Model Lauren Scruggs accepts a seven-figure insurance settlement from the owner of the plane whose propeller cut her hand off...Megan Fox and Brian Austin Green sued for alleged assault on paparazzo.\n\nHOSPITAL CORNER: Ryan Seacrest had an outpatient procedure on his elbow...Country star George Jones was hospitalized with an upper respiratory infection...American Idol alum Asia'h Epperson discharged from hospital after serious car accident...Bee Gees brother Robin Gibb underwent surgery for a perforated intestine...Jack Osbourne had an appendectomy...Gallagher rehospitalized after having his second heart attack in two weeks.\n\nREAD: Get all of Watch With Kristin's Daily Spoiler Chats right here!\n\nTV LAND: Keith Olbermann fired up over getting fired by Current TV...Jimmy Kimmel is hosting the Emmys this year...Ousted American Idol hopeful Heejun Han talks about what's next for him...Jennifer Love Hewitt takes off a lot of clothes for the new Lifetime series The Client List...Stars of Modern Familywant a raise...Gleeand Smashstars are a hit at GLAAD Media Awards...Camille Grammer leaving The Real Housewives of Beverly Hills...Which shows tanked this week?\n\nRECAPVILLE: Catch up on Survivor: One World, American Idol, The Voice, Dancing With the Stars, Celebrity Apprentice and Mad Men.\n\n MORE: Game of Thrones Cheat Sheet?Get Caught Up for Sunday's Premiere\n\nSCREEN PLAY: Kristen Stewart talks steamy Fifty Shades of Grey...There will be an Anchormansequel, with flutes and everything!...20th Century Fox pulls Neighborhood Watch teasers and posters in aftermath of Trayvon Martin shooting...We review Lily Collins and Julia Roberts in Mirror Mirror and Sam Worthington and Liam Neeson in Wrath of the Titans.\n\nTRAILER PARK: Vampire Bella looks hungry in Breaking Dawn: Part 2...Jennifer Lawrence tries to make it out of the House at the End of the Street alive...Sacha Baron Cohen is a despotic buffoon lost in Manhattan in The Dictator.\n\nMUSICAL NOTES: Listen to Jennifer Lopez's new single, \"Dance Again\"...Aerosmith announce summer tour...Australian band Jet pack it in...Madonna denied Deadmau5's jab that MDNA promotes Ecstasy use...Watch The Vampire Diaries star Kat Graham's \"Put Your Grafitti on Me\" video...Lady Gaga stars in a picture of herself sans makeup.\n\nMORE: Demi Lovato Sneak Peek: How She Picked a Boyfriend for \"Give Your Heart a Break\" Video\n\nSURREAL ESTATE: Javier Bardem and Penélope Cruz have moved into a luxury (duh) apartment building next to Kensington Palace. You know, where Prince William and Kate Middleton (and now Prince Harry) live...Kristin Cavallari's family facing foreclosure on their Laguna Beach mansion...Rosie O'Donnell listed her Miami Beach mansion for $19.5 million.\n\nSEEN: Madonna's not-so-little-girl-anymore Lourdes smoking in NYC...George Clooney and Stacy Keibler enjoying another getaway to Cabo San Lucas...Eddie Cibrian and rumored-to-be-pregnant Leann Rimes passing through airport security...Reese Witherspoon starting to look pregnant as she leaves an L.A. office building...Pretty pregnant Uma Thurman on the beach in St. Barts...Lindsay Price out shopping with baby son Hudson...Lily Allen leaving a restaurant in London's Mayfair district after dinner with hubby Sam Cooper...Josh Kelley sneaking a kiss on Katherine Heigl's cheek...Hilary Duff getting her hair done in West Hollywood...Wilmer Valderrama and Minka Kelly on the same flight to Australia, hmmm...Barefoot Doug Hutchison and high heels-wearing Courtney Stodden strolling on the beach...Beyoncé toting daughter Blue Ivy in a faux-fur (we think) sling...Charlize Theron running errands with baby sonJackson...Kaley Cuoco kissing Pepper frontman Bret Bollinger courtside at a Lakers game...Lea Michele and Cory Monteith flying into L.A. from NYC together...Taylor Swift and Dianna Agron catching The Hunger Games together at Hollywood's Arclight Cinemas...Jessica and Ashlee Simpson pulling bridesmaid duty at a friend's wedding...Jessica Simpson and Eric Johnson getting caught in one of those rare L.A. rainstorms."},{"articleId":"16586","title":"Will Hunger Games Inspire More Strong-Female Films?","source":"E! Online","articleLink":"http://feeds.eonline.com/~r/eonline/topstories/~3/H7qipz0Hb-Q/305366","displayContent":"Will the successes of The Hunger Games and Bridesmaids cause studios to greenlight more movies with strong female leads??Stacy J., via Twitter\n\nIf you're holding your breath for a big-screen Wonder Woman, you're about to kill a whole lot of brain cells. Those cells are never coming back, and, for the time being, neither is the great comic book amazon. Nonetheless, there is hope; Jennifer Lawrence and Kristen Wiig have sparked a small revolution for women in pockets of Hollywood.\n\nIf you want to join up, here's your guide:\n\nNo doubt, The Hunger Games and Bridesmaids are both successes.  Lawrence's turn as the bow-wielding, dinner-roll-cradling Katniss Everdeen helped rake in a ridiculous $152.5 million in its opening weekend. And Wiig's comedy?tired food-poisoning japes aside?also has been greeted as a success by audiences and critics alike. Wiig has downplayed the possibility of a sequel, but demand for her and her projects is higher than ever.\n\nSo does all that equal more and better fare for female moviegoers?\n\nIn the kickass female genre, The Hunger Games has spurred some activity among film development types. Watch out for news of Starters, a Hunger-Games-style book featuring a teenage heroine in a dystopian world. According to reports, it's the next hot book-to-film franchise.\n\nENOUGH ALREADY: Will Someone Please Pay Attention to Josh Hutcherson?\n\nBut that said, don't look for an immediate flood of bow-and-arrow-wielding heroines on the big screen, says Sharon Waxman, editor-in-chief of The Wrap.\n\n\"Greenlighting a movie requires so many other elements,\" she points out. \"It's not just The Hunger Games doing well that will lead to a change. Movies have to go through budgeting, casting.\"\n\nAnd Starters hasn't even been officially auctioned off yet, for chrissakes.\n\n\"When Hollywood reacts to a movie, it's not immediate,\" confirms Borys Kit of The Hollywood Reporter's Heat Vision blog. \"It takes a year or two before you really see anything. Right now, you can't make a blanket statement and say that everything has changed.\"\n\nWhat we are seeing is more female-centric projects in general.\n\n\"The most immediate impact of Hunger Games was this bidding war, on the same weekend, over 50 Shades of Grey,\" Waxman notes.\n\nThat's the book about the virginal innocent lady who discovers bondage and domination with a mysterious guy.\n\nTHEY CAN FIGHT! But can they dress?"},{"articleId":"15964","title":"Week in Pictures: Spring Has Sprung for Beyoncé, Hilary Duff, Jessica Simpson and More!","source":"E! Online","articleLink":"http://feeds.eonline.com/~r/eonline/topstories/~3/NMg2-GjpOhg/305349","displayContent":"Celebs everywhere have caught spring fever, and it's showing up in their wardrobes.\n\nJessica Simpson didn't let a little pre-April shower get in the way of her cute and colorful maxi dress while out on the town with fiancé Eric Johnson. New moms Beyoncé and Hilary Duff snuck out sans baby for a bit of colorful mommy time. Trendsetter Suri Cruise continued the trend in the tyke department, rocking a pair of red tights that really pop! And Blake Lively was snapped on the set of Gossip Girl in teal, sunny yellow and robin's egg blue?the palette of a couture Easter basket.\n\nWhat else caught our eye this week? Lots! We celebrated the return of Mad Men and are eagerly awaiting Game of Thrones. Check out the galleries below for more of what we loved over the past seven days..."},{"articleId":"13981","title":"From Twin Towers to Trayvon, Spider-Man to Neighborhood Watch: 10 Films With Lousy Timing","source":"E! Online","articleLink":"http://feeds.eonline.com/~r/eonline/topstories/~3/wqCu8OjWM88/305046","displayContent":"For a movie to be successful upon release, a good marketing plan is a necessity.\n\nBut what happens when a Hollywood studio's ad blitz is suddenly derailed because of events out of its control?say by a natural disaster or major news story that's a little too close for comfort to the plot?\n\nWith news that 20th Century Fox is pulling the plug on teaser trailers for its upcoming Ben Stiller-Vince Vaughn comedy, Neighborhood Watch, in the wake of the Trayvon Martin killing, E! News takes a look back at nine other flicks that suffered a similar fate.\n\nFrom Hereafter to Phone Booth to Spider-Man, which films, unfortunately, made the cut?"},{"articleId":"13829","title":"Boy band mania spreads as One Direction conquer U.S.","source":"Reuters.com","articleLink":"http://feeds.reuters.com/~r/reuters/entertainment/~3/5leEwJ3BbPI/us-onedirection-idUSBRE82U00P20120331","displayContent":"Members of British-Irish band One Direction pose after performing on NBC's 'Today' show in New York, March 12, 2012.\n\n\"Since we've been out here, it's been crazy, it seems to have blown up a bit, it's been insane for us, we're just riding the wave, working hard and having a lot of fun,\" said band member Harry Styles.\n\nNiall Horan, Zayn Malik, Liam Payne, Louis Tomlinson and Styles, all aged between 18 and 21, joined forces during the 2010 edition of Britain's \"The X Factor,\" after judge Simon Cowell suggested that the boys, who were competing individually, should sing together as a band.\n\nAfter coming in third place on the show, the band's debut single, \"What Makes You Beautiful,\" topped the UK singles chart, giving them a strong foundation to bring their album, \"Up All Night\" - a collection of infectious pop songs - to the U.S. market.\n\n\"When you're younger, America's this huge place where you go on holiday, and now we're working out here and doing shows, it's crazy,\" said Styles.\n\nThe boys have become hot property in the U.S., with hundreds of excited young girls turning up to their scheduled appearances and gaining a strong following on social media platforms. More than 3.9 million Facebook fans and 2.5 million followers on Twitter, often calling themselves 'Directioners.'\n\n\"Up All Night\" sold more than 176,000 copies in its first week, making chart history in the United States.\n\n\"We wouldn't have been able to get that number one without the fans. We just can't thank them enough, because it was their work as much as ours,\" said Tomlinson.\n\nOne Direction will be performing at Saturday's Kid's Choice Awards and said they have a special surprise up their sleeves for their fans when they sing their hit song \"What Makes You Beautiful.\"\n\n\"We've done the song on a few different shows now, so we just wanted to make this one as big as possible, and surprise the fans with the performance side of things. We've got a big production and we want to get the audience involved with us,\" said Styles.\n\nThe boys will be performing alongside pop star Katy Perry at the annual awards show honoring children's favorite music, television, film and pop culture acts, with celebrities often getting slimed with a gooey green substance on stage.\n\nThe Kid's Choice Awards will be hosted by actor Will Smith, with appearances by Michelle Obama, Nicki Minaj, Zac Efron and Big Time Rush, and will air on Saturday on Nickelodeon cable channel."},{"articleId":"13820","title":"\"Bully\" director says never meant to make \"R\" film","source":"Reuters.com","articleLink":"http://feeds.reuters.com/~r/reuters/entertainment/~3/IgQha1NdAnI/entertainment-us-bully-director-idUSBRE82T1G020120330","displayContent":"The film, which opens in select theaters on Friday, has made headlines in recent weeks for receiving an \"R\" rating from a movie industry group for language, namely for multiple uses of one particular curse word. In the United States, an \"R\" means kids under 17-years-old must be accompanied by an adult.\n\nAfter failing to get the rating changed to one that is less restrictive, distributor The Weinstein Co. decided to release \"Bully\" without a rating. That, in itself, could limit audiences because some theater chains won't screen films without a rating.\n\nAs the release date neared, however, AMC Theatres decided to allow kids as long as they have parental approval, and Regal Cinemas and Carmike Cinemas will show it, too, but under the same restrictions as if it were rated \"R\".\n\nReuters spoke with Hirsch recently about the controversy surrounding the rating - he and others complain it bars the young audience for whom the movie is meant - as well as the subject matter and the filmmaker's own experience with bullying.\n\nQ: When you were shooting the documentary, did you know you were making an R-rated film?\n\nA: \"No, I didn't. Never in a million years did I think we would have an R-rated movie. The spirit of it never felt R-rated. We set out to show what really happens, what these kids go through and what bullying looks like. (The curse words) are incredibly meaningful in the context of the film. Language carries power. That's how bullying takes place.\"\n\nQ: Do you think that because you also subtitled the objected words, the visual of seeing them on the big screen made it seem more prominent to the Motion Picture Association of America?\n\nA: \"We chose to subtitle it because the audio was garbled, and you couldn't see (the bully) saying it. It's actually not very easy to understand what's being said. We needed the subtitles.\"\n\nQ: Did you consider putting sounds over the swear words to block them from being heard?\n\nA: \"Of course we considered it. My feeling is that language matters. (Victims of bullying) are constantly having their stories minimized. Sort of like, 'Oh it's not so bad.' Having been bullied, I can relate to that. A big piece of this film was to kill that argument, to show that it is bad, it's mean, it's scary and it's serious, so serious that kids are being driven to suicide. So for all those reasons, in this context, it matters. We're holding our ground because it matters.\"\n\nQ: Do you worry that some may find the film underwhelming because the \"R\" rating earned so much media coverage that the reality of seeing how the word is used is a bit of a let down?\n\nA: \"That's happened a lot. People see it and say, 'What's the problem?' Those who haven't seen it have said, 'Oh, this film has so much profanity, I'm afraid I can't take my family to see it.' The reality is there are six uses of the F-word. But there's probably four that are even really for real. One of them is while (a victim) Alex is being choked.\"\n\nQ: The film focuses on the victims, not on the perpetrators. Was that done on purpose?\n\nA: \"I felt like the perspective of this film was to walk in the shoes of these families and kids. That's the point of view of the film. That was where my comfort level was narratively. For me, the film lived these verite moments of what these families go through.\"\n\nQ: Did you ever feel compelled to follow the lives of one of the bullies, to show viewers what their personal life was like?\n\nA: \"Maybe that'll be for 'Part 2' (laughs). The truth is, it was difficult. What I can share is that the beating of Alex on the bus - we had to go back and get signed release forms from every single family from the kids that bullied him. If you notice in the film, only one face is blurred. So we had those conversations. A number of the families had never been made aware that the incident even happened. The families were really upset. There were tears. But they agreed to sign releases, which was extraordinary.\"\n\nQ: It's astonishing to see kids beating Alex up in full view of the camera. Did you use a hidden camera to capture it?\n\nA: \"It was not a hidden camera. They were aware that I was there. But I'd been in that school (filming) for almost a year. We stopped being interesting (to students) on week two. They were just kind of doing their own thing. On some level, they felt they had license to bully him because they'd been able to do it for so long.\"\n\nQ: You offered no statistics about bullying, about how bad it is in society, or its long-term consequences. Why?\n\nA: \"The minute you start putting experts and charts and graphs and solutions, to me it kills the opportunity for people to arrive at a choice to change on their own. The film ends and the conversation begins. Of course, I didn't always know that. I shot experts because I was insecure. But once we knew we had a story, then we found our voice with the film.\"\n\nQ: You experienced bullying growing up. Have people from your past come forth at all?\n\nA: \"I left the town I grew up in during middle school and I've reconnected with a lot of those kids because of this film. Some that had been cruel, some that had not, and some that had been in the middle. Some have donated significantly toward making the film. I've also connected with other kids that were bullied who I grew up with. They've reached out and said, 'thank you.'\""},{"articleId":"13726","title":"Current TV fires star commentator Olbermann","source":"Reuters.com","articleLink":"http://feeds.reuters.com/~r/reuters/entertainment/~3/y-pfn3IF28M/entertainment-us-usa-olbermann-idUSBRE82T1CA20120330","displayContent":"David Gregory (R), NBC News chief White House correspondent and host of ''Race for the White House'', and Keith Olbermann, host of ''Countdown with Keith Olbermann'', take part in the NBC News Decision '08 panel at the NBC Universal summer press tour in Beverly Hills, California July 21, 2008.\n\nBut Olbermann, in a series of Twitter postings on Friday, fired back at his former bosses saying Current's statements were untrue and vowing to take legal action.\n\nThe outspoken liberal, who hosted a one-hour prime time show on Current, clashed with network executives earlier this year over coverage of the 2012 U.S. presidential election campaign.\n\nFormer U.S. vice president Al Gore and partner Joel Hyatt, who founded Current in 2005 as an alternative to corporate controlled media outlets, announced Olbermann's departure in an open letter.\n\n\"Current was ... founded on the values of respect, openness, collegiality and loyalty to our viewers. Unfortunately these values are no longer reflected in our relationship with Keith Olbermann and we have ended it,\" they said.\n\n\"Current has a fundamental obligation to deliver news programming with a progressive perspective that our viewers can count on being available daily - especially now, during the presidential election campaign,\" the letter added.\n\nOlbermann joined Current in February 2011 after abruptly quitting his flagship program, also called \"Countdown,\" on MSNBC a month earlier. He was appointed chief news officer, took an equity stake in the fledgling channel and became its biggest draw attracting an average audience of about 177,000.\n\nA source familiar with the situation said Olbermann, who was reported to be earning about $50,000 per program, was terminated because he repeatedly failed to show up for work.\n\nThe source said he missed the key political nights of the Iowa caucus, the New Hampshire primary and the evening before Super Tuesday, which is one of the biggest primary election days in the race for the White House.\n\nThe TV channel accused him of disparaging Current TV and failing to promote the network.\n\nBut Olbermann claimed the network was in the wrong. On Twitter, he apologized to viewers and his staff for \"the failure of Current TV\" and said he had been trying to resolve his issues with Gore and Hyatt internally for more than a year.\n\n\"Instead of abiding by their promises and obligations and investing in a quality news program, (Gore and Hyatt) finally thought it was more economical to try to get out of my contract,\" Olbermann posted on Twitter.\n\n\"It goes almost without saying that the claims against me implied in Current's statement are untrue and will be proved so in the legal actions I will be filing against them presently,\" he tweeted.\n\nCurrent said \"Countdown\" would be replaced by a new program hosted by former New York Governor Eliot Spitzer, starting on Friday called \"Viewpoint with Eliot Spitzer\".\n\nSpitzer, who resigned as New York's top executive in 2008 in a prostitution scandal, hosted a current affairs show for CNN in 2011 that was canceled after less than a year.\n\nHe said in a statement he was \"thrilled to have the opportunity to host a show on Current TV that will provide insight into and analysis of the critical issues on the minds of Americans today.\"\n\nCurrent expressed confidence that Spitzer would deliver \"critical information on a daily basis.\"\n\n(Reporting By Jill Serjeant; editing by Bob Tourtellotte and Todd Eastham)"},{"articleId":"12876","title":"Harry Potter and the \"strange\" case of Oscars snub","source":"Reuters.com","articleLink":"http://feeds.reuters.com/~r/reuters/entertainment/~3/DoL2Aihtsv0/entertainment-us-harrypotter-oscars-idUSBRE82T0UL20120330","displayContent":"The series, based on J.K. Rowling's best-selling boy wizard stories, was nominated for 12 Oscars over its 10-year history, in the art direction, visual effects, makeup, cinematography, costume design and music categories.\n\nEach time it went away empty-handed, to the growing frustration of the cast and crew that worked on one of the most successful film franchises in history.\n\nThe final chance came with the concluding installment \"Harry Potter and the Deathly Hallows - Part 2\", released last year and shortlisted for art direction, makeup and visual effects.\n\nIn two of those categories it was beaten by Martin Scorsese's \"Hugo\", while the makeup award ended up going to Margaret Thatcher biopic \"The Iron Lady\".\n\n\"I think a lot of us look fairly wryly at the politics of the American Academy (of Motion Picture Arts and Sciences), of which I am a member,\" said John Richardson, special effects supervisor on the Harry Potter movies.\n\n\"It does beg the question why did Harry Potter not get recognized at all for the last Deathly Hallows film?\" he told Reuters at the press launch of the new Potter studio tour at Leavesden Studios just outside London.\n\n\"We got three nominations from the ... Academy for probably one of the best-made and best-grossing films of the year, whereas a Martin Scorsese film, Hugo, which wasn't anything like as successful, won three awards, or was it four?\"\n\nIn fact it was five -- art direction, cinematography, sound editing and mixing and visual effects.\n\nDeathly Hallows - Part 2 earned $1.3 billion in global ticket sales, according to Boxofficemojo.com, making it the third biggest movie of all time before inflation is taken into account. It was also a critical hit.\n\nNick Dudman, in the special makeup effects department, agreed that Potter films had been wrongly overlooked.\n\n\"We keep losing,\" he told Reuters. \"Potter has been very largely ignored by academies around the world, and it is slightly strange.\n\n\"But the work is its own reward in many ways. We make fabulous things, we have a great time doing it.\"\n\nRichardson said one reason why the Potter films failed to land any Oscars may have been the voting system, whereby the Academy's entire active membership can select winners in every category during the final ballot stage.\n\nThe BAFTAs, Britain's equivalent, differ in that all members can vote on eight main categories, but for every other nomination only those with specialist knowledge of that particular field can participate.\n\n\"The final (BAFTA) vote is a chapter vote, so the award is voted by your peers, if you like.\n\n\"It so happens that we won the BAFTA, but I think it gives a truer critique of the work rather than being voted on by, with due deference to everybody, a lot of people who don't necessarily understand the work or technology that's involved in creating the film.\"\n\nDeathly Hallows - Part 2 won the special visual effects BAFTA, beating Hugo, although Scorsese's film did trump Potter in the sound and production design categories.\n\nRichardson has been nominated six times for an Oscar, three of them for a Potter movie. He has won once, for \"Aliens\"."},{"articleId":"12292","title":"Chris Brown Cell Phone Robbery Case: No Charges Yet, Investigation Continues","source":"E! Online","articleLink":"http://feeds.eonline.com/~r/eonline/topstories/~3/z23Fyi7Tz84/305197","displayContent":"It remains to be seen if Chris Brown will eventually be charged for allegedly stealing a woman's cell phone in Florida last month.\n\nAccording to Miami-Dade State Attorney Katherine Fernandez Rundle, the investigation into the matter remains ongoing as detectives are continuing to interview witnesses.\n\nMORE: Chris Brown Super Death Hoax! Twitter and YouTube Join Forces to Kill off R&B Star\n\n\"We have taken the statements of our local witnesses and have just finished discussing with the lead Miami Beach Detective the additional witness information supplied by Mr. Brown's attorney Mark Geragos,\" said Rundle in a statement on Thursday. \"We must now interview these individuals, some of whom may be from out of state, just as we do in every criminal investigation in order to uncover the truth in its entirety.\"\n\nMORE: Rihanna Defends Her Recent Chris Brown Collaborations?\"It's Music and It's Innocent\"\n\nThe case in question began on Feb. 19 when, according to the police report, Christal Spann accused Brown of snatching her iPhone out of her hand outside a Miami nightclub as she was trying to take a photo of the singer inside his car.\n\nSpann claimed that the R&B star yelled, \"Bitch, you ain't going to put that on no website,\" as he reached out the window and grabbed the phone.\n\nBrown is currently on probation until 2014 for his assault on then-girlfriend Rihanna prior to the 2009 Grammy Awards."},{"articleId":"11547","title":"Katniss Crazyiness?Jennifer Lawrence's Top Five TMI Moments!","source":"E! Online","articleLink":"http://feeds.eonline.com/~r/eonline/topstories/~3/pnSNV-VmQuw/305079","displayContent":"OK, so it's hardly a national holiday (yet) but we just can't get enough of the candid, hilarious, tell-it-like-it-is J.Law.\n\nAnd in true Jennifer fashion, babe kept us fully entertained in her Rolling Stone interview, where she chatted about everything from sex swings to stripping down for a very lucky costar.\n\nToo much? Hardly!The outspoken star is never afraid to dish out a little TMI! So behold, Team Truth's top five totally uncensored moments from the ever adorable Katniss herself.\n\nREAD: Top Five Jennifer Lawrence Moments of the Week\n\n1. Jen Bares It All for?Zoe Kravitz?! Seriously. In her latest interview with Rolling Stone, the mag caught up with a few of Jen's costars to get the real scoop on the leading lady. X-Men: First Class costar and BFF Zoe Kravitz shared quite the epic J.Law tale:\n\n\"I'd met her a few times, and she was like, 'You should come over and we'll hang out.' So I go over to her apartment, and she opens the door in a towel. She's like, 'Come in, sorry, you're early, I was about to shower.' And she drops her towel and gets in the shower, and starts shaving her legs, totally naked. She was like, 'Are we here yet? Is this OK?' And I was like, 'I guess we're there!' \"\n\nLOL! And what a fab way to become fast friends. It's exactly that bare-all (pun intended) 'tude that makes Jen so popular with her fans and fellow actors. Could she be any cuter?!\n\n2. Jen Asks Woody Harrelson About His Sex Swing: J.Law certainly knows how to make a first impression. Just ask Woody Harrelson, who plays the drunken Haymitch in The Hunger Games. The first time Jen walked into his trailer, gal took one look at his yoga swing and made a high-larious observation:\n\n\"I walked into his bus to introduce myself and the first words that just fell out of my mouth were ?Is that a sex swing?!'\" Jen revealed to EW.\n\nLove! And while Jen was totally embarrassed by the sex swing slipup, Harrelson now admits it only made him adore her more:\n\n\"The first moment meeting this incredible, esteemed actress and she opens the door and is like ?Hi Woody, I just wanted to say? is that a sex swing?!'\" he remembers. \"I laughed so hard, then I said ?Well it could be.'\"\n\nTalk about a memorable first moment! Leave it to Jen to call it like she sees it.\n\n3. Jen Reveals She's an Expert Pee-er: Not only can Jen pee in the woods (Kat-piss Never-clean, anyone?) but she can do it really fast. Or so she revealed in Rolling Stone:\n\n\"I'm the fastest pee-er ever,\" she proudly admits. \"I'm famous for it.\"\n\nCongrats, Jen! And it's probably safe to say you're the only Academy Award-nominated actress turned franchise queen who is proudest of her peeing skills. Hey, whatever makes you happy!\n\n4. Jen's Got Her Mind in the Guter: So we already chose this par-tick moment for one of our top five J.Law moments last week, but we had to mention it again 'cause Jen's penis comment is just a par-fait dose of TMI.\n\nLet's refresh: Elizabeth Banks suggest a clever fan nickname for Peeta and Katniss?Peetniss, duh! To which Jen deadpans, \"Yeah that sounds a lot like penis.\"\n\nQuite the dirty mind Jen! But it is a catchy nickname?we fully applaud your moniker and the hilarious fan frenzy it ensued.\n\n5. Jen Knows How to Work Her Fame: No doubt, Jen's landing loads of free swag from her H.G. fame. But unlike other stars trying to score some free Louboutins, Jen's just trying to land another TiVo after missing the JerseyShore marathon:\n\n\"I got it [Jersey Shore] on TiVo, calm down. TiVo needs to give me three new TiVos now, because I've talked about it at almost every interview. And ever since Spanx at the Oscars, I know how this works. If I talk about it on an interview, I get it,\" Jen expertly explained to MTV News at The Hunger GamesLos Angeles premiere.\n\nAnd since Jen's flawless figure certainly doesn't need Spanx, we say, send a box her way, TiVo!\n\nSo there ya have it Awful readers?the five moments that make us think we've found our new BFF (lucky you, Zoe Kravitz).\n\nThank gawd no one told Jen some things are better left unsaid!\n\nOr we'd have five less TMI moments to totally obsess over."},{"articleId":"9734","title":"Spoiler Chat Daily: Glee \"Big Brother\" Scoop! Plus Gossip Girl, Pretty Little Liars and More!","source":"E! Online","articleLink":"http://feeds.eonline.com/~r/eonline/topstories/~3/WTWw7P_XYRk/305148","displayContent":"Gleedoesn't return with a new episode until April 10, but that doesn't mean we can't deliver some \"Big Brother\" scoop to you right now! You are welcome, folks.\n\nSo what's the deal with Kurt and Blaine in the next new episode? And who's coming to Pretty Little Liars to heat things up? All that, plus scoop on The Office, Gossip Girl, The Office and more in today's installment of Spoiler Chat?\n\nMORE: Catch up on all the latest TV gossip with our daily Spoiler Chat!\n\nBrighton: Thanks for the Glee scoop about Matt Bomer! His blue eyes are other worldly. Can we get some Klaine scoop, too?Not much to say about Klaine in \"Big Brother,\" because Kurt is too busy fawning over Cooper (Bomer) to really pay attention to his boyfriend's pain. Who can blame him? Until the end of the episode, that is. Kurt very sweetly pushes his love to make amends with his bro, reminding us Glee fans why Klaine are in it for the long haul. Love those two.\n\nwalkwithmePR: Is there any Puck in this episode? Thanks!Yes. A lot, actually. And it's not just for kicks. Puck has a big role in helping Finn figure out his future.\n\nNaomi: Pretty Little Liars? Anything will do!PLL is currently casting for what sounds like a new love interest for one of the gals. He'll be a charming and charismatic transfer student to Hollis College, definitely young enough to romance one of the Liars. But he's also on the fast track to law school, which might come in handy right about now, don't ya think? Who do you think will be swooning over the new guy?\n\nTiffanie in San Jose, Calif.: Andy and Erin are the new Jim and Pam on The Office! Please tell me they'll end up like Jam and get married and have babies!How crazy would those children be? Pray for their souls now. Ellie Kemper tells us that Andy and Erin are \"heating up again, despite her lack of amazing fashion,\" she says with a laugh. As for the babies, well we'd need to get another season of The Office to see those, right? \"I'm under contract for more seasons,\" she assures us. \"I'm just going to wait and see what happens.\" As will we.\n\nDanielle: I'm so far past bored with Blair and Humdrum Humphrey right now. Any Chuck-Blair news to keep me interested?Will you take one half of that pairing and just accept our Gossip Girl scoop on Chuck Bass? You will? How nice of you! Josh Safran tells us that Chuck's (Ed Westwick) journey for the rest of the season is all about his family. \"With Bart [Bass], since he died in season two, we brought him back as a ghost in flashbacks, so that's in our wheelhouse,\" he says. \"With Jack [Bass], it's fun to have Desmond, especially after last year when he and Chuck banded together and made their relationship as right as they could. It's fun to have him back this year on Chuck's side. And Chuck's storyline very much is about family so that's why you will be seeing more of Jack.\"\n\nYarlene: What's coming up on CSI: NY?One might think with eight seasons there is no place in New York left undiscovered, but a murder takes the CSI team into the little prime-time-explored area, Hell's Kitchen. Showrunner Pam Veasey dishes on the new episodes, \"We go into the culture and the history of New York in a different way. Four Points, which is Hell's Kitchen, it's predominantly Irish. What it's like today and the people living there know the history because they are the children of the children of the children of the people who started that area.\" It might be helpful to start brushing up on your Gaelic.\n\nMORE:Bones Renewed for an Eighth Season?Ready to Celebrate Its 150th Episode?\n\nVera: Bones baby scoop!Bones herself is not the most traditional person, and she definitely does not give birth in a normal, traditional way. But in an upcoming episode, she does something involving her baby that is surprisingly very traditional. Maybe it's at the insistence of her baby daddy?\n\nRosie: Happy Endings scoop: Dave and Alex!In the season finale of Happy Endings (which is incredible, by the way), there are moments between Dave and Alex that definitely lead you to believe the flame is rekindling. However, there is also a very charged scene between Penny and Dave in the episode. What are the differences between the two? Well, someone will say out loud to someone else that she might have feelings for Dave. Like, it's a real thing now! And the other girl ends the episode with Dave. D-R-A-M-A?drama!\n\nJaime in Austin: Any scoop on House of Lies' finale? I get the feeling Marty and Monica aren't going to kiss and make up.You got that right?but something will happen to forever alter their twisted, ex-with-benefits relationship. Showrunner Matthew Carnahan teased to us, \"There is continued push-pull, but I think what I'm interested in is Monica [Dawn Olivieri] undergoing a radical transformation and how that could upset their relationship.\" Added Ben Schwartz (Clyde, and of course P.Rex's Jean-Ralphio): \"There's a huge moment also [with the] custody battle?[their son] Roscoe is the thing that above all else Marty [Don Cheadle] doesn't want to lose. That's his rock when he comes home. To see what happens in the finale, to see who gets the child, it will just change the entire essence of the second season?what home base is for this person, if he goes home and no one's there. It's a totally different human being. What does he do with his free time? A lot of stuff that happens in the finale will change everything that happens in the second season. It changes how all of us act toward each other.\" Whoa! Sounds like the foundation is crumbling on Marty's House.\n\nSend us your Spoiler Chat Q's! Email TVDiva@eonline.com or tweet @KristinDSantos!"},{"articleId":"8946","title":"Gavin DeGraw's Struggle with Public Intimacy","source":"ETOnline","articleLink":"http://feedproxy.google.com/~r/ETTopStories/~3/kqCf-Tai5eM/index.html","displayContent":"The Most 'Influential' Celebs in the World?"},{"articleId":"5806","title":"Harry Potter tour focuses on behind-camera wizardry","source":"Reuters.com","articleLink":"http://feeds.reuters.com/~r/reuters/entertainment/~3/MkpAnEuxous/entertainment-us-harrypotter-tour-idUSBRE82T0DR20120330","displayContent":"\"Warner Bros. Studio Tour - The Making of Harry Potter\" opens to the public on Saturday, and organizers expect 5,000 visitors to file past the familiar sets, strange creatures and scale models every day.\n\nThey enter through the famous Great Hall, a cavernous room with stone-like walls, real stone floors and graffiti-marked tables where students of Hogwarts School of Witchcraft and Wizardry ate their feasts and enjoyed the Yule Ball.\n\nAlso preserved from the original films are Gryffindor Common Room, Professor Dumbledore's office, the potions classroom, Hagrid's hut, the Weasleys' kitchen and a section of the Ministry of Magic.\n\nThe giant spider Aragog, a version of the animatronic \"Hippogriff\" Buckbeak and eerily life-like models of the actors allow visitors to study up close the painstaking craftsmanship that every scene involved.\n\nThe animatronic Aragog, for example, needed 100 technicians to operate, real goat hair was inserted strand by strand to create Greyback's werewolf face and Ollivanders shop in Diagon Alley contained 17,000 individually labeled wand boxes.\n\n\"There's just so much detail in everything,\" said Rupert Grint, who played Harry's best friend Ron Weasley in the films.\n\n\"I'm so happy it hasn't all been put away into storage and collected dust and forgotten about because it's something that really needs to be celebrated,\" he told Reuters, sitting in the Weasley kitchen.\n\nThe output of hundreds of people working behind the camera on sets, costumes, masks and props were combined with computer-generated images in what special effects supervisor John Richardson called a unique collaboration.\n\n\"I've worked on nine of the (James) Bond movies and they didn't have the same look or aspect or thought process, if you like, that's gone into the Potters.\n\n\"Never before have you had a group of technicians work for 10 years, 12 years in my case, all on the same film without, virtually, a break.\"\n\nThe tour, which lasts around three hours, finishes with a walk along Diagon Alley which leads eventually to a large room filled with a huge scale model of Hogwarts castle.\n\nIts courtyards, towers and turrets were filmed and enhanced with digital effects and more than 2,500 lights were installed to simulate lanterns and torches inside.\n\nEarly reviews of the attraction at Leavesden Studios just outside London have been mixed, with some criticism levelled at the ticket prices and other costs.\n\nAdults pay 28 pounds ($45) and children 21 pounds, and a pass for a family of four costs 83 pounds. Children under five go free, and tickets must be booked online in advance. There are tickets available for most week days over the coming months.\n\nVisitors also have to pay for transport -- a short train ride from London, for example, followed by a special bus service from Watford Junction, and they exit the tour through a gift shop where the most expensive item is a replica of the robes worn by Dumbledore costing 495.95 pounds ($790).\n\nMany of the sets are cordoned off, although interactive elements include a \"magic\" iron moving at the wave of a wand, touch screens helping children navigate Hogwarts and broomsticks to sit on and \"fly\" over digitally imposed backgrounds.\n\n\"Prices aside, the tour is a must-see for Potter fans and a fitting monument to the team who created Britain's most successful film franchise,\" said Anita Singh in the Telegraph."},{"articleId":"695","title":"Smiles and a warning as Lindsay Lohan ends probation","source":"Reuters.com","articleLink":"http://feeds.reuters.com/~r/reuters/entertainment/~3/M-i1QWmqGX4/entertainment-us-lindsaylohan-idUSBRE82S10D20120330","displayContent":"Actress Lindsay Lohan smiles during a progress report hearing in her DUI case at Airport Branch Courthouse in Los Angeles, California, March 29, 2012.\n\nActress Lohan, 25, who has made multiple trips to court, jail and rehab since a 2007 drunk driving and cocaine possession arrest, was praised for completing months of community service at a Los Angeles morgue and court-ordered psychotherapy.\n\n\"She has done everything that this court has asked of her,\" Los Angeles Superior Court judge Stephanie Sautner said. \"Probation terminates today. Now.\"\n\nLohan, dressed conservatively in a powder blue pants suit and black top, let out a sigh of relief and hugged her attorney.\n\nAlthough the \"Mean Girls\" actress will remain on informal probation until 2014 for a 2011 jewelry theft, she will not have to report regularly to court and will no longer be compelled to live in Los Angeles, as long as she stays out of trouble.\n\nSautner sent Lohan on her way with words of warning. \"I know it is kind of hard when people are following you all over the place, but that is the life you chose. You need to live your life in a more mature way. Stop the nightclubbing and focus on your work.\"\n\n\"I don't expect to see you again,\" Sautner added. \"Goodbye and good luck.\"\n\nLohan's once promising movie career was derailed by the 2007 arrest, years of hard partying, missed court dates and failed drug tests that saw her probation extended repeatedly.\n\nBut the former \"Parent Trap\" child star is now on the comeback trail. She posed for Playboy, hosted TV sketch show \"Saturday Night Live,\" has an upcoming guest part in TV musical \"Glee\" and a TV movie role as screen legend Elizabeth Taylor.\n\nOn Thursday she thanked Sautner for helping her turn her life around. \"I just want to say thank you, your honor, for being fair. It has really opened a lot of doors for me.\"\n\nLohan later told celebrity website TMZ.com in a phone call that ending probation \"has just been a tremendous weight that has lifted off my shoulders\".\n\nThe actress, who has said that parties are no longer her thing, told TMZ she wanted to put the focus back on her acting career, adding \"I have not been to a club for I can't tell you how long.\"\n\n\"I am honored to be playing Elizabeth Taylor,\" she said of her upcoming role as the former child star. \"There are a lot of similarities (in her life) that I can relate to.\""},{"articleId":"518","title":"Florence + The Machine get \"Unplugged\" for MTV","source":"Reuters.com","articleLink":"http://feeds.reuters.com/~r/reuters/entertainment/~3/6gFmNN19JkQ/entertainment-us-mtv-unplugged-idUSBRE82S0NP20120330","displayContent":"Florence Welch performs with her band Florence & The Machine during the BRIT Music Awards at the O2 Arena in London February 21, 2012.\n\nThe soulful British singer and her backing band taped their \"Unplugged\" concert in New York's oldest synagogue building back in December to become the first of eight episodes airing across MTV and sister networks Vh1 and CMT. The Civil Wars and Dierks Bentley also are slated to perform during the new season.\n\nMTV debuted its Emmy-winning \"Unplugged\" series in 1989, and it became an instant hit by taking singers and bands typically associated with big sounding pop music and stripping them down to basic, acoustic instruments and vocals. Over the years, the show has featured performances from popular artists including Mariah Carey, Eric Clapton, Nirvana and Jay-Z on intimate, often unconventional stages.\n\nBacked by a 10-person choir, The Voices of Rivers, Welch performed fan favorites such as \"Drumming Song\" from her group's 2009 debut \"Lungs,\" as well as the single \"Never Let Me Go\" from her most recent record, \"Ceremonials.\"\n\nQueens of the Stone Age's Josh Homme joined Welch for a cover of \"Jackson,\" most famously sung by Johnny Cash and June Carter. Welch also covered \"Try A Little Tenderness.\" Kanye West, who attended the taping with fellow rapper Q-Tip, sampled Otis Redding's version of the song on \"Watch the Throne,\" his 2011 album with Jay-Z.\n\nWelch said she was in awe of the former synagogue in which she and the Machine played and where the stage was decorated with dozens of candles.\n\n\"I had to stop myself after every song,\" Welch told Reuters. \"I would be like, 'Wow.'\n\n\"It was so amazing performing the songs stripped back and just really being able to concentrate on the songs and the emotions,\" said Welch.\n\nDuring the show, the soft-spoken singer told the live audience: \"This is a real moment for me and to be doing an 'Unplugged' session is amazing.\"\n\nVan Toffler, president of Viacom's Music and Logo Group, said MTV and its networks carefully select the artists they invite to perform, and self-promotion, even by big-name acts, is no guarantee of a spot on the show.\n\n\"We get lobbied by a bunch of artists,\" said Toffler. \"We're quite selective about who ultimately gets to do an 'Unplugged.'\"\n\n\"Unplugged's\" striped-down approach suits the hard-to-classify, Grammy-winning folk duo The Civil Wars, who will appear on Vh1's \"Unplugged\" in May.\n\n\"We're kind of tailor-made for that,\" said the duo's John Paul White.\n\n\"We're already unplugged!\" laughed his partner Joy Williams, who will be seven months pregnant when she tapes their episode of \"Unplugged\" slated for May.\n\n\"Growing up with the show, it's a strange full circle thing,\" said White. \"We were talking about how big those 'Unplugged' shows were for us, to see our favorite artists in a different, more humanizing light.\"\n\nLast year \"Unplugged\" expanded to include CMT, opening the series to country artists. Dierks Bentley, whose single \"Home\" is nominated for Song of the Year at Sunday's Academy of Country Music Awards, will follow The Civil Wars, with an episode of \"CMT Unplugged\" to air this spring.\n\n\"I love breaking my songs back down to their original acoustic foundation,\" said Bentley. \"When I write these songs by myself or with friends, we just use acoustic guitars ... so, it's fun to sometimes go back to just the simple groove and idea you had to begin with.\"\n\nToffler believes simplicity and rawness are the keys to \"Unplugged's\" lasting appeal. \"Either you've got the chops in talent or you don't, and 'Unplugged' is not going to hide any blemishes in your capabilities,\" said Toffler.\n\n(This story corrects date to April 8 in paragraph 1)"},{"articleId":"444","title":"I got male attention really late: Sameera Reddy","source":"TOI-Entertainment","articleLink":"http://timesofindia.feedsportal.com/fy/8at2Etk0Xxtkb25C/story01.htm","displayContent":"My main goal is to look thin, says Bollywood actress Sameera Reddy, who struggled with her weight during adolescence and is proud of her voluptuous figure today\n\nI'm voluptuous I call myself voluptuous, not skinny. Skinny is what most girls today are trying to achieve, which, thankfully, I'm not obsessed with. I think the charm of being an Indian woman is about having those curves, and I'm sure men out there don't want to be holding on to a bag of bones! As most women endeavour to starve themselves to be skinny, I like maintaining a certain oomph value, which I think is what is working today. I think we went through the whole size zero fanatical phase, and now, maybe thanks to Vidya Balan, it's over.\n\nI weighed 105 kilos When I was 19, I weighed 105 kilos. For years, when I got into the industry, a lot of people from my school and my college would come up to me and say we can't believe it, it's like you're another person. I know what an emotional struggle it's been. People don't realize that criticism is one of the hardest things to take. And we are in an industry where everything is criticized. It has made me very grateful for my body, I will not take my body for granted, I will not put it through crash diets, and I think meditation has really helped me understand that we live in a world wherea it's all about competition, and you have to draw the line somewhere. So being really obese as a kid and having two supermodel sisters was one of the worst things ever, but at the same time, it also makes me appreciate people for what they are. I will not get carried away by people who are good looking or slim, I know that behind all that is a lot of struggle.\n\nI would eat an idli a day For me, it's really been such a struggle as a woman, and it's not only in Bollywood - today, even a housewife is under pressure to look trendy so the husband stays. And people are falling prey to bulimia and anorexia. I feel really sad. In college, Meghna, my sister - her waist was 22 inches, and I was double that. I used to go through torture, I used to cry, I used to go through a lot of self-loathing. You end up thinking 'I am not deserving enough'. I sometimes used to eat one idli a day and then faint. I did absolutely the most ridiculous things in college till my mother caught me one day and said that if you don't stop this nonsense, I'll lock you up.\n\nI got male attention late It took me two years to lose weight, because I did it the right way. And I am so glad I did it, otherwise today I'd be suffering from a lot of issues. I got male attention really late. And it was very hard for me to get attention. So today I'd love to see all those guys who never gave me a chance. I distinctly remember this one incident of Valentine's Day in my college, when my friends played a prank on me. There was this one guy I had a huge crush on. So somebody wrote a letter to me with his name signed on it, and it was the happiest day of my life, I was crying! I thought this guy I had a crush on actually liked me back! So I wore my Sunday best, and I went down to the building thinking, he's going to be there and I have to meet him at 8 o'clock. At 9, everybody else comes, and they're laughing at me, and I said, 'what happened, where's Aamir?' And they're like, 'oh, that was just a prank, did you really fall for it? Are you stupid?'\n\nI stammered in school In school, because I was so nervous about my weight, I used to stammer. So club both these things and you have the makings of a person with really low self-esteem. But the thing that I struggle with the most even today is that everybody expects so much. They expect you to be at your best all the time. I feel bad because everybody struggles. If you think that Priyanka Chopra or Bipasha Basu get up in the morning and look the way they look, that's not true. They work really hard at it.\n\nYou have to eat right I don't eat everything. It's a lie if somebody says that. Everything is a work in progress, and the most important thing about food is understanding that food is not your enemy. If you eat right, it'll give you a glow on your face, it will keep you healthy. It's not about not eating and it's not about too much eating. I always say, eat to survive, don't gorge. If there's anything I want, even if it's a piece of cake, I'll have a bite, I'll feel satiated. I'll use my brain to send a message to my body saying I think I'm done. The most important thing is having an emotional connect with diet, which is what most women are all about. We are all emotional eaters, which is the worst thing you can do. Which is why systems are placed in my head, and I know very well whether I am eating because I'm hungry or I'm eating to make myself feel better. So it's not about eating less or more, it's about eating right, and small meals. So sometimes for lunch I'll just have a roti and bhaji, and people will say 'oh you eat so less'.\n\nLauki juice is a miracle worker! I don't like fried food. I don't like the taste of oil in my mouth, unless it's raw olive oil in salad. One thing I swear by is hot water and lemon in the morning. But something I've discovered in the last two years is raw lauki juice. It is a miracle worker! For the rest of my life I am going to be on it.\n\n11-year-old wannabe star It was heartbreaking - I met an 11-year-old the other day and she came up to me and she said, 'I loved the boots from this song of yours and I love the eye shadow'. And she said I want to be Miley Cyrus, so I am going to drop out of school and start training to become a star. It wasn't training to become a singer, it wasn't training to become a model, it was 'I am training to become a star'! It really broke my heart to hear that."},{"articleId":"493","title":"No one can threaten Vidya?s position: Ekta Kapoor","source":"TOI-Entertainment","articleLink":"http://timesofindia.feedsportal.com/fy/8at2Etk0Xxtka25C/story01.htm","displayContent":"Talking about revolution, how can we not mention Bollywood's powerhouse producer, Ekta Kapoor. She's stepped in to the 'Dirty' business like no man has, but quiz her about it and she says, \"I don't do the dirty work, I make others do it for me. Ha, ha.\" That's truly Ekta for you. While talking about competition and threats, she says, \"Currently, no one can threaten Vidya's position, she's made a place for herself. And one person I would never release my film with would be Aamir Khan , because he is unbeatable.\" We need more women like her."}]