[{"articleId":"21889","title":"Yankees' Pineda to miss start of season on DL (Yahoo! Sports)","source":"Yahoo! Sports","articleLink":"http://us.rd.yahoo.com/sports/rss/top/SIG=11rajg0qt/*http%3A//sports.yahoo.com/mlb/news?slug=ap-yankees-pineda","displayContent":"KISSIMMEE, Fla. (AP)?New York Yankees pitcher Michael Pineda will begin the season on the disabled list after tests showed inflammation in a shoulder tendon, but no structural damage.\n\nThe injury to Pineda helped the Yankees settle their rotation, at least to begin the season. C.C. Sabathia, Hiroki Kuroda, Phil Hughes, Ivan Nova and Freddy Garcia will begin as New York?s starters.\n\nPineda underwent treatment, including icing, at Steinbrenner Field in Tampa after an MRI exam on Saturday. The right-hander doesn?t know when he?ll resume playing catch.\n\n?I?m feeling a little better,? Pineda said. ?A little sore. I?m a little sad. I?ll be OK.?\n\nPineda experienced soreness in the back of his right shoulder during the Yankees? 13-9 win over the Philadelphia Phillies on Friday night. He allowed six runs and seven hits in 2 2-3 innings, and struggled with his fastball velocity again, averaging around 91 mph.\n\nManager Joe Girardi said he was ?very relieved because the rest of the MRI came out good.?\n\n?You always worry about rotators and labrums and that kind of thing. The rest of his shoulder looked really good. He just had a little tendinitis,? he said.\n\nAcquired from the Seattle Mariners in a winter trade for catcher Jesus Montero, Pineda struck out 18 and walked 10 in 19 spring innings. The All-Star had a 5.58 ERA.\n\n?We?ll be conservative and make sure when he goes back out, he feels good,? Girardi said. ?That would be the smart thing to do.?\n\nLeft-handed reliever Cesar Cabral, who had 12 strikeouts and 2 walks in 11 1-3 innings, and had a 1.59 ERA in 10 appearances, will go on the 15-day DL. The team said Cabral, also hurt in Friday?s game, has a stress fracture on the tip of the left elbow.\n\nAlso, Andy Pettitte took another step forward in his comeback by throwing in his second simulated game.\n\nPettitte, who ended a one-season retirement by agreeing to a minor league contract on March 16, threw 25 of 33 pitches for strikes in the game broken down into two segments. He struck out five of the nine batters he faced.\n\n?We?ve never felt we need to speed Andy up and we won?t because you know that you?re hurting him,? Girardi said. ?I think Andy is a lot more familiar with his body and what it takes maybe than us. We?ll listen.?\n\nPettitte could be ready to join the Yankees in May. The left-hander said his arm feels great, but that he has a lot of work left when it comes to building leg strength.\n\n?Felt really good in the first inning,? Pettitte said. ?The second inning, I got good and fatigued in the legs. They?re not in shape.?\n\nIt now appears that Pettitte will not pitch in a spring training game before the team breaks camp next Wednesday.\n\n?It?s not that big of a deal,? Pettitte said. ?I just don?t want to rush something.?\n\nNOTES: Non-roster INF/OF Russell Branyan, sidelined most of spring training by a lower back disc injury, could resume swinging a bat next week and will continue a rehabilitation program for another three to four weeks. ?Definitely frustrating,? he said. ? RF Nick Swisher (groin) felt fine one day after playing five innings of defense in a minor league game. He is scheduled to play in Sunday?s game against Miami."},{"articleId":"21845","title":"Cavs' Irving has sprained shoulder (Yahoo! Sports)","source":"Yahoo! Sports","articleLink":"http://us.rd.yahoo.com/sports/rss/top/SIG=11tul7p36/*http%3A//sports.yahoo.com/nba/news?slug=ap-cavaliers-irving","displayContent":"NEW YORK (AP)?Cavaliers rookie point guard Kyrie Irving?s sprained right shoulder could keep him from facing the Knicks.\n\nIrving injured his shoulder during Friday night?s loss to Milwaukee in Cleveland. He traveled with the Cavaliers to New York and was evaluated Saturday morning by the team?s training staff, which listed him as questionable for the game. It?s not yet clear if Irving had X-rays or an MRI.\n\nThe presumptive rookie of the year, Irving said after Friday?s game that he was in pain. He also revealed he separated his right shoulder as a high school sophomore.\n\nDespite favoring his shoulder, Irving scored 29 points and made all six 3-point attempts in Cleveland?s 121-84 loss to Milwaukee.\n\nThe Cavaliers have lost six straight and nine of 10 to drop from the playoff chase."},{"articleId":"21186","title":"Source: Ex-Illini coach Weber hired by Kansas St (Yahoo! Sports)","source":"Yahoo! Sports","articleLink":"http://us.rd.yahoo.com/sports/rss/top/SIG=11tm3kgo9/*http%3A//rivals.yahoo.com/ncaab/news?slug=ap-kansasst-weber","displayContent":"Kansas State has hired Bruce Weber as its basketball coach, turning to someone who once led Illinois to the national championship game to calm the waters in the wake of Frank Martin?s departure for South Carolina.\n\nA person a familiar with the situation told The Associated Press that Weber will be introduced at a news conference Saturday afternoon at Bramlage Coliseum. The person spoke on condition of anonymity because no official announcement had been made.\n\nWeber was fired by Illinois after going 210-101 over nine seasons, which included six trips to the NCAA tournament and a runner-up finish in 2005. The Illini went 17-15 and 6-12 in the Big Ten this season, prompting the administration let Weber go with three years left on his contract.\n\nHe takes over for Martin, who returned a once-proud program to national prominence after Bob Huggins? departure for West Virginia five years ago. Weber will be the fourth coach to lead Kansas State in the past eight seasons?and the third to cause some consternation among fans.\n\nHuggins was hired still carrying baggage from his messy divorce with Cincinnati, while Martin was a nondescript assistant who had never been a college head coach.\n\nWeber certainly has experience running a program. It?s just that not all of it has been good.\n\nHe was considered one of the rising stars of the profession after taking Southern Illinois to a pair of NCAA tournament appearances, one of which ended in the regional semifinals. He then took over a program at Illinois that had been built into a perennial contender under Bill Self?now the coach at Kansas, just down the Interstate from Manhattan, Kan., and the Wildcats? biggest rival.\n\nThe Jayhawks were scheduled to play Ohio State in the Final Four on Saturday, just hours after officials at Kansas State were to announce Weber?s hiring.\n\nWeber had immediate success at Illinois with players largely recruited by Self, returning to the NCAA tournament his first four seasons. That included a 37-2 record during the 2004-05 season, which ended with a 75-70 loss to North Carolina in the national championship game.\n\nThe program began to slip soon after, though, and fans who had grown accustomed to winning began to sour. The Illini had a losing record by Weber?s fifth season in charge, and despite winning 20 or more games the next three seasons, the program had faded from the national spotlight.\n\nWeber never seemed entirely comfortable following Self at Illinois, and now he?ll be matching wits with the Jayhawks? coach at least twice a year.\n\nIn fact, Weber had grown so tired of the comparisons to the uber-successful Self that he walked into the locker room before a game in 2003 dressed entirely in black. The quirky coach told the Illini that he was ?going to throw a funeral. It?s the end of Bill Self.?\n\nThe idea was to somehow get across the message that the program had moved on.\n\nThat?s exactly what Kansas State fans are being forced to do.\n\nMartin?s intense style and own quirks endeared him to many Kansas State fans. Of course, the winning helped with that?at least 20 wins each of the past five seasons, four of them ending in NCAA tournament berths, with a trip to the regional finals with Jacob Pullen in 2010.\n\nThe school?s career scoring leader, Pullen grew up in Chicago and now plays overseas. He offered his blunt assessment of Weber?s hiring via Twitter, even misspelling the new coach?s name: ?Bruce Webber didn?t think I was good enough to play at Illinois and I don?t think he is good enough to coach at Kansas State.?\n\nOthers have praised the hiring of Weber, whose strong recruiting ties to Chicago will no doubt come in handy at a school that?s forced to recruit nationally. Weber is energetic and personable, two traits that will come in handy as he attempts to quell a fan base wary of more change."},{"articleId":"19784","title":"Source: Kansas St. hires ex-Illinois coach Weber","source":"SI.com","articleLink":"http://sportsillustrated.cnn.com/2012/basketball/ncaa/03/31/kansas.state.bruce.weber.ap/index.html?xid=si_topstories","displayContent":"A person familiar with the situation says Bruce Weber has been hired by Kansas State to replace men's basketball coach Frank Martin, who left for South Carolina.\n\nWeber will be introduced Saturday afternoon at Bramlage Coliseum, according to a person who spoke to The Associated Press on condition of anonymity because no official announcement had been made.\n\nWeber was fired by Illinois after going 210-101 over nine seasons, which included six trips to the NCAA tournament and a runner-up finish in 2005. The Illini went 17-15 and 6-12 in the Big Ten this season before the administration let Weber go with three years left on his contract.\n\nHe takes over for Martin, who returned a once-proud program to national prominence after Bob Huggins' departure for West Virginia five years ago. Weber will be the fourth coach to lead Kansas State in the past eight seasons.\n\nCopyright 2012 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."},{"articleId":"16286","title":"Winn: A tweaked KU lineup could pay dividends","source":"SI.com","articleLink":"http://ncaa-tournament.si.com/2012/03/30/leveraging-lineups-kus-key-combos/?xid=si_topstories","displayContent":"NEW ORLEANS ? Kansas is not favored to win its Final Four game, and Las Vegas has assigned it the third-lowest championship odds of the remaining teams. But the gap between KU and Ohio State is just three points, according to kenpom.com?s efficiency-based projections, and the gap between KU and Kentucky would only be two possessions. By playing slightly above themselves, the Jayhawks could win this thing. It may just be a matter of leveraging their best lineups. Let?s take a look at the data:\n\nKU?s 80-67, Elite Eight win over North Carolina was a 70-possession game. All-America power forward Thomas Robinson and center Jeff Withey played 35 possessions of defense together; for the other 35 possessions, just one of them was on the floor.\n\nOn the 35 Robinson-Withey possessions, the Tar Heels averaged 0.74 points per possession.\n\nOn the other 35 possessions, UNC averaged 1.17 PPP. To put this in context: Had Carolina?s offense played the entire game at its Withey-Robinson rate, it would have scored just 52 points. Had Carolina?s offense played the entire game at its other rate, it would have scored 82 points.\n\nTo put it in a different context: Against the Withey-Robinson combo, Carolina?s offense scored at a Towson-like level. As in, a worst-in-Division-I level. When Carolina?s offense faced just one of KU?s two posts, it scored at a Kentucky-like level. As in, a second-best-in-D-I level.\n\nOn court/off court data from a single game shouldn?t be used to make large-scale conclusions. Season-long play-by-play data can be more revealing, though, and I mined through a file of approximately 75 percent* of Kansas? 2011-12 season to look at various lineup efficiencies.\n\nOn the season, Robinson averages 31.6 minutes per game and Withey averages 24.4. In this sample, they were on the floor together 44.8 percent of the time, and Kansas? efficiency margin (+0.24) was twice as good as it was for all other lineup combinations:\n\nThe defensive gap is not as wide as it was in the Carolina game, but believe me: the difference between a team with a +0.24 efficiency margin and a +0.12 margin is immense. A team with a +0.24 margin is a title contender.\n\n(* Clean play-by-play data in which full 10-man lineups could be identified was not available for the entire season ? but I believe the 75-percent sample, which includes more than 1,000 minutes of game time, to have value. It is raw data that has not been adjusted for competition.)\n\nI realize that stating, ?Kansas is better with Robinson and Withey on the floor together,? is not earth-shattering. One is a National Player of the Year candidate, and the other is one of the country?s elite shot-blockers. Nor, I am aware, is it possible for the duo to be subbed in and out of the game together. Kansas lacks any big bench bodies ? Kevin Young and Justin Wesley cannot play the five-spot ? and so if Robinson?s out, Withey needs to be in, and vice versa.\n\nThe point is that if the Jayhawks can find a way to milk a few more possessions than average ? even just 5-10 ? out of the Robinson-Withey lineup, it would significantly increase their odds of knocking off Ohio State. And if they were to similarly lean on that lineup against (most likely) Kentucky in the title game, they might have a chance of pulling off that upset, too.\n\nKansas uses three-guard lineups at nearly all times, with Tyshawn Taylor handling the point-guard duties. That leaves three potential combinations at the 2-3 spots, the most common of which is starters Elijah Johnson and Travis Releford, who played 60.7 percent of minutes together in my play-by-play sample. The Johnson-Releford combo, however, was the worst of the three:\n\nThe eye test suggests that backup guard Conner Teahan is not a strong defender ? he sometimes looks like a below-average defender ? but the play-by-play data suggests otherwise. The average efficiency margin of his combos (+0.24) is far better than the Johnson-Releford duo (+0.05). There?s still value in the eye test, but it?s possible that Teahan is a stealth defensive asset when used in the right lineups. And it?s possible that, if Kansas can leverage its most effective combos in the Final Four, it?ll find a way to survive until Monday night."},{"articleId":"13925","title":"Ex-NFL quarterback Ryan Leaf arrested in Montana (Yahoo! Sports)","source":"Yahoo! Sports","articleLink":"http://us.rd.yahoo.com/sports/rss/top/SIG=11scqa89l/*http%3A//sports.yahoo.com/top/news?slug=ap-ryanleaf-arrest","displayContent":"HELENA, Mont. (AP)?Former NFL quarterback Ryan Leaf was arrested Friday in his Montana hometown of Great Falls on burglary and drug possession charges, police said.\n\nThe circumstances surrounding Leaf?s arrest were not immediately clear. Great Falls Police Sgt. Dean Bennett, who confirmed Leaf?s arrest, said Friday night that he had not seen a report detailing the allegations against the ex-football player.\n\nLeaf was booked on felony charges of burglary of a residence and criminal possession of dangerous drugs, plus a first-time charge of misdemeanor theft, Cascade County Detention Center Officer Robert Rivera said.\n\nLeaf was freed on $76,000 bond and is scheduled to make an initial court appearance Monday.\n\nLeaf, a former standout quarterback for Washington State, was the No. 2 pick in the 1998 draft behind Peyton Manning. But Leaf flamed out as quarterback for the San Diego Chargers, gaining a reputation as one of the biggest busts in NFL history.\n\nThere is no phone listing for Leaf in Great Falls. A message left at his parents? house was not immediately returned Friday night.\n\nLeaf released a statement through his publicist, Wendy Ogunsemore on Friday night.\n\n?I?ve made some mistakes, and have no excuses,? the statement read. ?I am using the tools I?ve learned to move forward rather than backwards, and will be open to talking about the details in the days to come. I am confident that there will be further understanding when the facts are revealed, and feel very blessed for all of the support, especially from my friends and family.?\n\nLast year, Leaf had surgery to remove a benign tumor from his brain stem and later underwent additional radiation treatments.\n\nOn March 21, Leaf told an Associated Press reporter in an email exchange that he had struggled through treatments and had an MRI scheduled for the end of the month, but ?I?m doing/feeling much better and am excited for the rest of 2012.?\n\nFriday?s arrest also raises the question of whether his arrest means the 10-year probation plea agreement he negotiated with Texas prosecutors stemming from drug and burglary charges in 2009 will be revoked.\n\nJames Farren, the Randall County district attorney who negotiated the 2010 plea agreement, did not immediately return a text message seeking comment on Leaf?s arrest in Montana.\n\nIn 2008, when Leaf was a quarterbacks coach for Division II West Texas A&M, he was accused of burglarizing a player?s home. An investigation turned up that Leaf had obtained nearly 1,000 pain pills from area pharmacies in an eight-month span.\n\nHe resigned that year, was indicted in 2009 and the next year pleaded guilty to eight felony drug charges. Besides the 10 years? probation, he was fined $20,000.\n\nLast year, he wrote a book titled ?596 Switch??the name of a passing play in the Washington State playbook?that focused on the 1997 season when he led the Cougars to their first Rose Bowl in six decades."},{"articleId":"13833","title":"49-year-old Moyer earns spot in Rockies rotation (Yahoo! Sports)","source":"Yahoo! Sports","articleLink":"http://us.rd.yahoo.com/sports/rss/top/SIG=11q2tt05b/*http%3A//sports.yahoo.com/mlb/news?slug=ap-rockies-moyer","displayContent":"SCOTTSDALE, Ariz. (AP)?Jamie Moyer, at 49 years old, has made it back in the big leagues.\n\nMoyer earned a spot in the Colorado Rockies? rotation and will start the team?s second game of the season.\n\n?It is still Jamie Moyer. It?s the Jamie Moyer that was pitching prior to the arm injury that cost him the entire 2011 season. It?s the same guy,? Rockies manager Jim Tracy said Friday before the team?s spring training game against the Texas Rangers at Salt River Fields.\n\n?It?s the same worker. It?s the same professional. It?s the same stuff, same velocity, same pitches. When he?s right, same type of effectiveness. You?re going to venture into this.?\n\nMoyer, who is entering his 25th major league season, posted a 2.77 ERA this spring and beat out 22-year-old Tyler Chatwood and 28-year-old Guillermo Moscoso for a rotation spot.\n\n?I was excited. I?m happy. I?m honored,? Moyer said. ?But in the end, like Jim said, `You earned it.? That was my goal coming here.?\n\nMoyer will start April 7 against the Houston Astros. He can become the oldest pitcher in major league history to earn a victory.\n\nThe last player to play in the majors at 49 years old was infielder Julio Franco, who finished out the season with the Braves in 2007 after turning 49 in August.\n\nMoyer will be 50 in November.\n\nThe left-hander will follow right-hander Jeremy Guthrie in the rotation and precede right-handers Juan Nicasio and Jhoulys Chacin, who will pitch the home opener April 9 against the San Francisco Giants.\n\nIn a move that could save the bullpen in case Moyer has a short outing, he will start after Guthrie, an innings eater who has pitched more than 200 innings each of the last three seasons.\n\nWith an off day on April 10, the Rockies will open the season with a four-man rotation. Left-hander Drew Pomeranz will join the rotation and make his first start April 15.\n\nPomeranz was optioned to Triple-A on Friday.\n\nMoyer missed the 2011 season after undergoing Tommy John surgery. By returning to the majors, he will be the active leader in victories (267), innings (4,020) and starts (628). In his last season, he went 9-9 with a 4.84 ERA with the Philadelphia Phillies in 2010.\n\n?It?s an opportunity, and I think it?s a great opportunity to try to take it and run with it,? Moyer said. ?I?ve looked as my whole career as an opportunity, especially as I?ve gotten older.?\n\nMoyer?s last start was Wednesday against the Chicago White Sox. He had to work out of trouble and threw 89 pitches in four innings, allowing three runs and seven hits, with three walks.\n\nThe following day, Moyer was experiencing normal leg stiffness and displayed ?no red flags,? Tracy said.\n\n?I think he can still be very, very effective,? Tracy said. ?He has incredible know-how. He?s an incredible pitch maker. When he?s right, he can carve a strike zone up.?\n\nMoyer thanked him. ?I stopped him right there and said, `Thank you is not necessary because we don?t give handouts here. Your professionalism and the way you?ve handled yourself is immensely appreciated,?? Tracy said.\n\nMoyer has a career record of 267-204 with a 4.24 ERA. He was an All-Star in 2003 with the Seattle Mariners, and he made his major league debut on June 16, 1986 with the Chicago Cubs.\n\nIn corresponding roster moves, the Rockies optioned Pomeranz and Moscoso to Triple-A and reassigned catcher Wilkin Castillo and outfielder Andrew Brown to minor-league camp.\n\nTo help limit the 23-year-old?s innings, Pomeranz will begin the season in the minors and make a start April 10 before joining the Rockies on April 15."},{"articleId":"13821","title":"Davis, Haith win AP player, coach awards (Yahoo! Sports)","source":"Yahoo! Sports","articleLink":"http://us.rd.yahoo.com/sports/rss/top/SIG=11n5pdt6h/*http%3A//rivals.yahoo.com/ncaab/news?slug=ap-apawards","displayContent":"NEW ORLEANS (AP)?Anthony Davis was busier than any of the other players in the Final Four.\n\nThe Kentucky freshman had to make the circuit of Player of the Year presentations Friday, not that he was complaining.\n\n?There were a lot of awards yesterday and today,? Davis said with a big smile. ?It?s a great feeling, especially as a freshman. I?ve been working hard and now it?s rewarding.?\n\nDavis became the first Kentucky player and second freshman to be selected The Associated Press? Player of the Year. He picked up his latest trophy, along with Coach of the Year Frank Haith of Missouri.\n\nIt was Davis? second ceremony of the day, and he had to make a quick exit to get to practice, part of the preparations for the national semifinal matchup against Louisville on Saturday.\n\n?This is great to be here and hopefully we can win the national championship and accomplish our goal,? he said. ?Even if we come up short we still had a great season.?\n\nThe 6-foot-10 Davis sure did.\n\nHe averaged 14.3 points?on a team with six double-figure scorers?10.0 rebounds and 4.6 blocks while shooting 64.2 percent from the field. His block total is a school record and third-best ever for a freshman. He was the Southeastern Conference?s Player, Freshman and Defensive Player of the Year.\n\n?My expectations were nothing like this; I wasn?t planning on any awards,? he said of how he approached his first?and what many project will be his only ? season in college basketball. ?I have to thank my teammates for those lob passes for easy baskets and for them getting beat off the dribble for all those blocked shots. Without them there are no awards.?\n\nNo Kentucky player had won the award which started in 1961, and the only other freshman to win it was Kevin Durant of Texas in 2007.\n\n?I?m surprised because you?ve had a lot of great players from Kentucky,? Davis said. ?Hopefully I?m starting something, and a lot of Kentucky players will win this award.?\n\nDavis received 43 votes from the 65-member national media panel that selects the weekly Top 25. Balloting was done before the NCAA tournament.\n\nThomas Robinson of Kansas was second with 20 votes, and Draymond Green of Michigan State received the other two votes.\n\nJimmer Fredette of BYU won the award last season.\n\nHaith?s first season at Missouri got off to a rough start and ended with a second-round thud in the NCAA tournament. In between his unpopular selection to replace Mike Anderson at Missouri and the Tigers? stunning loss to 15th-seeded Norfolk State, things went very well.\n\nMissouri won 30 games and the Big 12 tournament and was ranked in the AP poll the entire season, reaching second for one week and was third in the final poll.\n\nHaith received 21 votes from the media panel, while John Calipari of Kentucky and Tom Izzo of Michigan State tied for second with 10 votes each. The voting was done before the NCAA tournament.\n\nUnlike Davis, Haith didn?t have a practice to rush to Friday.\n\n?It?s good to see your peers at something like the Final Four, but the disappointment of your season being over is still there,? Haith said. ?Still, I can?t tell you how honored and humbled I am with all the recognition.?\n\nHaith left Miami after seven seasons to take over the program at Missouri.\n\n?My landing in Columbia wasn?t greeted with a lot of yeas and congratulations, but I wasn?t disappointed, rather encouraged because that showed me passion. And I wanted that, because that kind of passion means you have a chance to be successful,? he said.\n\nHaith?s coaching style was very different from Anderson?s uptempo pressure way and that meant change, something a lot of college players don?t take to easily.\n\n?Mike Anderson left me some pretty good players,? Haith said. ?They bought into change, and that?s not always easy when you have a system in place they want. I give the players a lot of credit for buying in. When the players buy in you have a chance to be successful.?\n\nHaith, who joined Norm Stewart in 1994 as the only Missouri coaches to win the award, said it was early in the season when he knew the players had bought in.\n\n?We were in Kansas City for the CBE Classic, and we beat Cal and Notre Dame,? Haith said. ?We changed things, and I think you have to have success to make change. We saw success, and those guys started to buy in. And it was all because of the leadership on the team.?\n\nHaith was hired at Missouri with the knowledge the program he was leaving was under NCAA investigation for possible rules violations.\n\n?I think we, the Mizzou Nation and my family, all will be happy when it?s all over with, but we can?t control the NCAA and the time frame in which they work,? he said.\n\nHe was asked if he was confident the investigation would come up empty."},{"articleId":"13494","title":"Payton, the Saints and GM appeal NFL suspensions (Yahoo! Sports)","source":"Yahoo! Sports","articleLink":"http://us.rd.yahoo.com/sports/rss/top/SIG=123hfm770/*http%3A//sports.yahoo.com/nfl/news?slug=ap-saints-bounties-payton","displayContent":"NEW ORLEANS (AP)?Saints coach Sean Payton is appealing his season-long suspension from the NFL for his role in New Orleans? bounty system. And he?s not the only one looking for a little relief from the penalties handed down by Commissioner Roger Goodell.\n\nGeneral manager Mickey Loomis, assistant coach Joe Vitt and the Saints organization each decided to appeal on Friday.\n\nPayton will also ask Goodell for guidance on the parameters of the suspension, which runs through next year?s Super Bowl, a person familiar with the situation told The Associated Press, speaking on condition of anonymity because the league and the Saints did not announce Payton?s plan to appeal.\n\nSaints spokesman Greg Bensel did confirm that Loomis was appealing his eight-game suspension and, separately, the team would challenge its $500,000 fine and loss of second-round draft picks this year and in 2013.\n\nVitt, suspended for six games, is doing the same. David Cornwell, representing Vitt as head of the NFL Coaches Association, confirmed the decision in an email to the AP.\n\nGoodell last week announced the suspension of Payton, starting Sunday, for his role in connection with New Orleans? bounty system, which offered improper cash bonuses for big hits that either knocked opponents out of games or left them needing help off of the field.\n\nFormer defensive coordinator Gregg Williams, who left the Saints after last season to join the St. Louis Rams, ran the bounty program and has been suspended indefinitely.\n\nThe commissioner has said since the unprecedented penalties were announced that the Saints? coach would likely be allowed to continue working as his appeal was resolved. However, he added that the challenge would be expedited, indicating that Payton would not likely be able to add on much work time should his appeal be upheld.\n\nGoodell also said at the NFL owners meetings this week in Florida that Payton could have some contact with the team but did not go into detail, and Payton indicated that he was still a little unclear about that, as well.\n\nWith all the uncertainty, Payton is trying to compress as much planning for the 2012 season into whatever time he has left at Saints headquarters this weekend.\n\nThe NFL could not immediately provide details on how Payton?s decision to file an appeal on Friday would affect the timeline for the process to play out.\n\n?The decision to appeal is for Sean Payton to make and announce as he deems appropriate,? NFL spokesman Greg Aiello said. ?If there are appeals, the commissioner will arrange for expedited hearings, as he stated at the league meeting.?\n\nThe results of the appeal could affect whether Bill Parcells comes out of retirement to take over as interim coach while his former offensive assistant and protege is suspended.\n\nParcells has said he would consider coaching the Saints if asked. At a spring training game in Jupiter, Fla., on Friday, Parcells declined to answer questions about the possibility.\n\n?I know better than that,? Parcells said.\n\nPayton and Loomis played golf with Parcells this week to talk to him about the team?s predicament, and Parcells has told multiple media outlets that he would consider taking the Saints interim post to help his friend.\n\nIf the suspension is reduced, however, the Saints could decide it makes more sense to promote an assistant from the current staff.\n\nThere are also three strong candidates among Saints assistants to take over as interim coach: offensive coordinator Pete Carmichael, defensive coordinator Steve Spagnuolo and offensive line coach Aaron Kromer. Payton expressed confidence in the abilities of his own assistants to compensate for his absence, but also has voiced some misgivings about saddling those coaches with additional responsibilities.\n\nSince his suspension was announced, Payton has been putting in long hours with his staff and that of Loomis as they try to lay out plans for the 2012 draft and season.\n\nLoomis will be able to oversee the draft and handle other roster moves up until the season starts. Then, barring a successful appeal, he will serve his suspension for failing to put a stop to the bounty system in a timely way.\n\nPayton said earlier this week that he had already laid out plans for the offseason training program and the beginning of training camp, up until the Saints play Arizona in the Hall of Fame game Aug. 5 in Canton, Ohio.\n\nThe NFL?s investigation in New Orleans found that Payton initially lied to league investigators about the existence of a bounty program and instructed his defensive assistants to do the same.\n\nPayton twice apologized for his role in the bounty program, saying he takes ?full responsibility? for a system that operated for three years under his watch.\n\nThe NFL has said as many as 27 players also could be sanctioned for their role in the scandal, but it is not yet clear when that might happen, creating additional uncertainty for New Orleans and some teams that have signed former Saints defensive regulars as they tried to build their 2012 rosters.\n\nDeMaurice Smith, executive director of the NFL Players Association, told the website Pro Player Insiders that the league hasn?t turned over what the union would consider direct evidence of player involvement in a `pay to injure? scheme.\n\n?If there is direct evidence of a `pay to injure? scheme implicating players or anybody involved,? Smith said, ?we are asking the league to turn over that information.?"},{"articleId":"3539","title":"Baylor coach Mulkey diagnosed with Bell's palsy (Yahoo! Sports)","source":"Yahoo! Sports","articleLink":"http://us.rd.yahoo.com/sports/rss/top/SIG=11v2scvcv/*http%3A//rivals.yahoo.com/ncaaw/news?slug=ap-finalfour-mulkey","displayContent":"WACO, Texas (AP)?Kim Mulkey is enjoying another trip to the Final Four and the pursuit of her second championship at Baylor, even if she doesn?t want to smile.\n\n?Don?t let anybody tell you I?m not happy because I?m not smiling,? the coach said Thursday after revealing she has been diagnosed with Bell?s palsy, a usually temporary form of facial paralysis. ?I?m not smiling because I don?t want people to see my crooked smile.?\n\nThe ailment also affects Mulkey?s hearing, especially when she raises her voice. And it makes her left eye droop, something she tried to alleviate by using her left index finger to prop open her eyelid while sitting at a podium.\n\nThat won?t keep her from coaching the undefeated Lady Bears, or alter how she is on the bench.\n\n?It?s not going to keep me from hollering,? she said. ?This isn?t going to change how I coach, it isn?t going to change anything. I?ll just be another ugly coach with a crooked face.?\n\nMulkey disclosed her diagnosis before the Lady Bears held their last on-campus practice and then left for Denver, where they play Stanford on Sunday night.\n\nWhen on the court for practice in the Ferrell Center, the coach?s voice echoed loud and clear while she shouted instructions and encouragement to her players.\n\nBaylor is two wins from its second national title and the NCAA?s first 40-win season.\n\nThe other national semifinal Sunday also features a pair of No. 1 seeds, Connecticut and Notre Dame. The Lady Bears beat both of those teams at home earlier this season, and the victory over the Irish came in the preseason WNIT championship game.\n\nThe 49-year-old Mulkey, now being treated with medication, first noticed a strange feeling in her tongue while in Des Moines for the NCAA regional last weekend. She initially thought that was caused by some outdated toothpaste she had used.\n\nThings got worse Wednesday when the coach had what she described as a weird feeling in her mouth while eating, then saw in a mirror on her way to practice that her eye was drooping and her smile was crooked.\n\nConcerned that the symptoms could be the onset of a stroke, Mulkey checked with team trainer Alex Olson, and he advised her to get immediate attention. The diagnosis of Bell?s palsy came after she saw two doctors and had an MRI that ruled out a tumor or a stroke.\n\n?I know that I will recover,? Mulkey said. ?It will take some time to recover and it may get worse before it gets better.?\n\nBaylor advanced to its second NCAA Final Four in three years with a 77-58 win over Tennessee and coach Pat Summitt on Monday night.\n\nSummitt announced in August she had early onset dementia, Alzheimer?s type. It is unclear if the 59-year-old Summitt, whose 1,098 career victories are the most by any coach in NCAA basketball history, will return for a 39th season.\n\nBaylor officials said Bell?s palsy is caused by a dysfunction of the facial nerve, resulting in the inability to control facial muscles on the affected side. It usually has a rapid onset of partial or complete paralysis that often occurs overnight. Many doctors believe the inflammatory condition is caused by a virus.\n\n?I don?t obviously have a severe case of it,? Mulkey said. ?Because I?ve seen the worst. I?ve seen people who have it where their face is totally drooping.?\n\nMulkey is being treated with anti-viral medication and oral steroids to reduce the inflammation of the facial nerve that causes the problem. But it can take weeks or months for symptoms to subside.\n\nOlson said most people taking steroid medication will begin to see some improvement within about 10 days. The trainer said Mulkey is being monitored to make sure there aren?t any adverse effects from the medicine.\n\n?You sure?? Mulkey yelled while turning toward Olson, inducing some humor into the explanation. ?And y?all (reporters) need to look out because they tell me these steroids make me irritable.?\n\nMulkey said she is concerned about possible inner ear problems because of the mile-high elevation in Denver, and that doctors will have medicine for her if that becomes an issue.\n\nThe public disclosure of her diagnosis came after players Brittney Griner, Odyssey Sims and Destiny Williams?with Mulkey also sitting at the podium? talked about the Final Four, then left the room to get ready for practice. The players already had been told about the coach?s ailment but they didn?t address it.\n\nMulkey missed Baylor?s NCAA tournament opener in 2009 after surgery to remove a kidney stone, though she returned to the bench two days later.\n\n?I learned then your health keeps you in the game or it doesn?t, and we have really no control over health issues a lot of times,? she said. ?I learned then this game can be taken away from you in a heartbeat. I?m pretty tough and I can hang through a lot of things, but I know when something?s not right. I knew the kidney stone wasn?t right, I knew this wasn?t right.?"}]
