[{"articleId":"22253","title":"Make a DIY PVC Shoe Rack [DIY]","source":"Lifehacker.com","articleLink":"http://feeds.gawker.com/~r/lifehacker/vip/~3/o7gxcDgC9NA/make-a-diy-pvc-shoe-rack","displayContent":"If you're looking for an inexpensive way to store your shoes that has a unique look consider making this PVC shoe rack. All you need to do is buy 4-in or 6-in diameter PVC pipe and cut it into lengths of 1.5 feet.\n\nTumblr user Why Not Do It Yourself advises that once you've decided how many PVC \"cells\" to have in your rack you can start gluing the first and second rows together with Gorilla Glue or any other glue that works with PVC. When you're finished you can paint the rack to match your wall or go crazy and make it neon green.\n\nGrace Space Saver and Looks Cool Too!!! Why Not Do It Yourself on Tumblr"},{"articleId":"20324","title":"Google Maps 8-bit version for NES: April Fools arrives a day early in Mountain View","source":"Engadget.com","articleLink":"http://www.engadget.com/2012/03/31/google-maps-8-bit-version-for-nes-april-fools/","displayContent":"Well, it appears that April Fools in full effect -- at least if you ask Google. Today the company introduced its \"latest\" build of Google Maps , dubbed Google Maps 8-bit version, tailored specifically for the Ninentendo Entertainment System . According to Google, this version of Maps will come in the form of a special NES that can connect to the internet via dial-up. This apparently allows most of the heavy lifting to get done on Google's servers, where the maps are rendered to 8-bit form \"in real-time\" Better yet, it even supports voice search. Naturally, there's no word on a release date, but you can currently check out the \"beta\" by visiting Google Maps in your browser and selecting \"Start Your Quest.\" That said, that company warns that \"your system may not meet the minimum requirements for 8-bit computations\" -- something tells us it'll still be less resource-intensive than Crysis , though. We've checked it out and found some goodies, including an alien at Area 51, so let us know what you come across during your journey in the comments. [Thanks to everyone who sent this in]"},{"articleId":"19436","title":"Expedia adds to Google's EU antitrust woes, decision expected after Easter","source":"Engadget.com","articleLink":"http://www.engadget.com/2012/03/31/expedia-google-eu-antitrust/","displayContent":"EU troubles \"We haven't seen the complaint yet, but we've been working to explain how our business works, cooperating with the European Commission since this investigation began.\" The EU Competition Commissioner says a decision will be made after Easter, at which point Mountain View will either be charged, or the investigation will be dropped. If only that were the end of its EU troubles\n\nGoogle's position as the dominant search engine doesn't come without a price. Smaller search sites have already tapped on the EU Commission's door to register their complaints about how they are ranked, and Microsoft has also let its feelings on the matter be known . Now, we can add the Redmond spin-off, Expedia, to that list of disgruntled firms. The travel search site claims it has specific details outlining how the search giant has violated European anti-competitive laws. A Google spokesperson issued a statement saying"},{"articleId":"17217","title":"Flurry's analytics: Apple's App Store revenue still leading, but Amazon Appstore close behind","source":"Engadget.com","articleLink":"http://www.engadget.com/2012/03/31/flurrys-analytics-apple-app-store-amazon-appstore-android-google-play/","displayContent":"Not like we haven't seen this dog-and-pony show before , but Flurry's latest round of analytics -- which measured revenue of 11 million daily active users from mid-January through the end of February 2012 -- shows Amazon's Appstore pulling in a shocking amount of revenue given the short life that it has lived. Apple's strength in sales has been well documented , but the latest report shows that for every $1 generated in the iTunes App Store, $0.89 is being spent in the Amazon Appstore. Looking more broadly, the numbers show that just $0.23 are generated in the Google Play halls for every $1 spent in the App Store, but that's hardly a new phenomenon; the ease of sideloading (amongst other factors) has raised complaints from Android developers for years now. Flurry's conclusion is that Google's core strength simply isn't in running a store -- something it's about to do once more with Android slates -- while both Apple and Amazon excel in doing just that. Curiously, Windows Phone and BlackBerry were left off of this report, but we're hoping to see those cats thrown in the next 'go round. After all, RIM sure seems certain that its developers are making out just fine"},{"articleId":"16420","title":"Top 10 (Mostly) Harmless Geek Pranks [Video]","source":"Lifehacker.com","articleLink":"http://feeds.gawker.com/~r/lifehacker/vip/~3/5LbzeI8B668/top-10-mostly-harmless-geek-pranks","displayContent":"Being a geek amongst the non-technical has the advantage of making you seem like a wizard, and your magical computer skills can come in handy on April Fools' Day. Here are our top 10 favorite (mostly) harmless geek pranks for a fun, tech-savvy April Fools' Day.\n\nAlthough it's a prank that's a bit obvious and likely won't fool anybody who's aware of what day it is, a fun and harmless choice is to literally turn someone's internet upside down. If you've ever edited IP tables this won't be a particularly difficult operation. All you have to do is redirect your victim's traffic using the instructions over at Upside-Down-Ternet. With everything in place, your victim's web browser will display every site in reverse.\n\nThe BSOD Screensaver is a classic geek prank that loads a fake Windows error screen to trick the viewer into thinking their computer just experienced a major crash. The user can even enter commands and interact with it. This is likely to cause a bit of panic, and can be especially fun if you're the victim's go-to tech support person. They'll call you up for help and you'll get to resolve the issue with two simple words: April Fools'.\n\nIf you're actually stuck at work on April Fool's Day, make the best of the situation by tricking your coworkers into talking to the printer. These realistic upgrade notices make it look like the printer has voice commands. Readers will start to recite the commands and get absolutely nowhere while you watch and enjoy from afar.\n\nWhen friends need computer help, I often help them over VNC. Whether we're in the same room or not, it generally freaks them out to see their computer moving around without their control. If people get freaked out when they know what's going on, imagine how they'd respond if they didn't expect the computer to suddenly start using itself. Controlling another machine on the same local network is very easy. All you need is to set up a VNC server on that machine and connect to it from your own laptop or desktop. Using VNC with Windows requires a little bit of setup, but it mainly involves installing a VNC client and server like TightVNC. Macs can just use OS X's built-in screen sharing feature. To turn it on, open up System Preferences and choose the Sharing section. Turn on Screen Sharing and then add yourself as a user. Alternatively you can click the Computer Settings button and enter a VNC password so you can access the computer with only that password. Either way, when you're done you can just go into the Finder on your computer and press Command+K. From there, type in vnc:// plus the IP address of your victim's computer. That will load their screen and you might just be able to fool them that a ghost has possessed their computer. If they watched PBS in the early 90s, they might have a reason to seriously believe that.\n\nMost of us are used to the QWERTY keyboard layout, but the Dvorak Keyboard was designed to try and make typing faster. Some people swear by it, but generally they like to have a keyboard that actually represents the location of the Dvorak layout. If you were to turn this layout on with a normal QWERTY keyboard connected, pressing most keys would not produce the expected result. ZDNet offers up some good instructions on how to enable Dvorak support on Windows so you can make the target of your prank wonder why their keyboard seems to have lost its mind.\n\nWant to control just about any TV with one, all-powerful remote? The Ninja Remote is capable of controlling practically any television without the need for prior configuration. It works by quickly blasting practically every remote code in the book so your commands will work on any infrared device that receives them. On top of that, it can bomb a television and cause it to randomly change channels and volume for several minutes. Finally, you can even jam other remotes from functioning so you're in complete control. It'll cost you $30, but you'll be able to reuse the prank on several people all day long.\n\nThis toilet paper overdispenser is hard not to love even if you're the butt of the joke. It's just really funny to watch, and it's hard not to feel flattered when someone puts that much effort into adding a crazy motor to your TP roll. If you want to show your DIY prowess and pull a great prank at the same time, just follow this Instructables post and learn how to pull it off.\n\nWhile it's no simple feat, installing the troll face inside someone's monitor will supply you with pranking joy that's pretty much equivalent to the effort you put in to the prank itself. As you can see from the video to the left, you'll have to do a bit of work to take your victim's monitor apart and install a lightly transparent print out of the troll face image, but once you've got it in there your victim will be wondering how it got there and how to get it out. If the troll face isn't your style, this prank works just as well with any image. If you know something that will creep out and confound your victim more than the troll face, by all means use it instead.\n\nIf you're not familiar with text expansion, it's a term for a tool that lets you type a shortcut (e.g. \"phone#\") that will expand to a different and often larger block of text (e.g. 323-555-1234). Text expansion apps work with entries called snippets, which include the word you type and the text it expands to. As a prank, you can enter common words as shortcut. For example, if your friend's name was Harold you could enter a shortcut that expands Harold to the word Dumbass. (My apologies to any Harolds out there?I'm sure you're all beautiful, smart people deserving of all the love in the world.) It's a very simple trick to play and you can be as creative and detailed as you want. You can also be as appropriate or vulgar as your relationship with the victim dictates, making it a safe prank for most everyone. If you want to try this prank but need a recommendation for text expansion software, check out our top picks for Windows and OS X. You can even do it on an Android or iOS device.\n\nImagine if someone your best friend hates ended up sending them a text message to confess their undying love. That probably wouldn't actually happen, but with text spoofing you can make it look like it did. Text spoofing is an incredibly simple yet effective prank that lets you send a text message that appears to come from any number you want. It's not hard to think of many ways you could freak out a friend or family member with a spoofed text, so it can be a lot of fun on April Fools' Day. That said, don't go crazy. You don't want to actually cause real trouble for anyone and that is easy to do when you can put any words in practically anyone's mouth. When the person receiving the spoof text replies, it'll actually go back to the real person. This is a great trick, but use it carefully. With great power comes great responsibility, and all that.\n\nSo how do you actually spoof a text message? There are a number of services to help you out. The one I tried was called SpoofTexting, which is a hack for jailbroken iPhones. It worked very well and sufficiently creeped out a couple of my friends. If you don't have a jailbroken iPhone, you can send spoofed texts through your browser using SneakSMS. Generally these services cost money to send a text, but it isn't terribly expensive to buy a credit or two for the occasion. There are also options for earning free credits, so you can avoid paying if you're willing to do a little work."},{"articleId":"13824","title":"10 AirPlay-Ready iPad Apps That Make Apple TV Worth It ","source":"ReadWriteWeb.com","articleLink":"http://feedproxy.google.com/~r/readwriteweb/~3/MqLNtWsa7Vw/10_airplay-ready_ipad_apps_that_make_apple_tv_wort.php","displayContent":"When I first unboxed the new 1080p Apple TV and plugged it in, I wasn't blown away. Having used a Boxee Box for the last 16 months, I've come to expect flexibility and a broad selection of content sources from my streaming set-top boxes. In fact, after several minutes of playing around with it, I was tempted to box it back up and send it back.\n\nThen I tried AirPlay. Mirroring my iPad's display on the TV screen, I was suddenly able to not only stream any video I could find, but look at photos, browse the Web and view other apps on the big screen. If the Apple TV has a killer feature, this is it. Some of the device's biggest shortcomings - limited content, lack of a keyboard for text input, no Web browser - are instantly alleviated once you toggle that AirPlay switch.\n\nWhile you can technically beam your entire iPad screen onto your TV using AirPlay, there are certain things that the feature is best suited for. For the most part, it's great for streaming video. When you're navigating the iPad's home screen, launching apps or trying to use apps that have fluid animations, there's a noticeable lag. It's really too bad. Google Earth, for example, would be cool on a TV.\n\nWhat the feature is primarily intended for is watching video content, and it does that quite well. Even so, some apps offer a better experience than others.\n\nIt might seem too obvious to mention, but YouTube's iPad app is an essential one for the Apple TV. The same is true of its tablet-optimized mobile Web app. There is a YouTube app that ships with the Apple TV, but searching the world's largest user-submitted video site from a tablet is a much better experience than typing letters in one-by-one using the Apple remote.\n\nDespite its tendency toward shorter videos, YouTube is quickly becoming a mainstay in many living rooms, as viewers turn toward the service for everything from music videos and funny viral clips to longer-form videos that are slowly making their way onto YouTube as Google gets serious about premium content.\n\nAgain, this is an obvious choice, but it shouldn't be excluded from this list. Like YouTube, Netflix is already included on the Apple TV, but the user interface is quite different on the iPad. Most importantly, one can navigate the app by touching and typing rather than tediously pointing a remote at the screen. Netflix subscribers who own an Apple TV and an iPad will probably spend quite a bit of time with this app.\n\nIn addition to its own Apple TV-style set-top box, Boxee offers an iPad app that includes some of the platform's best features.\n\nLike the Boxee media player UI, its iPad app pulls in videos that are shared by your friends on Facebook and Twitter, much like Flipboard does for written content. Another one of Boxee's most useful features is its \"Watch Later\" queue, which you can populate using its browser bookmarklet, Instapaper-style. If you come across a great TED talk, music video or mini-documentary during the course of your day and don't have time to watch it, just click the button.\n\nThe Boxee app also allows you to stream videos that are stored locally on your computer using its Media Manager. If you have a lot of video files, this feature helps make up for the Apple TV's lack of external storage.\n\nShowYou is another app that curates video content via your social connections, and it does a really great job of it. The UI is a little nicer than Boxee's and it takes better advantage of the screen's real estate by providing a massive array of recently shared videos on a grid, which you can navigate by swiping left or down.\n\nShowYou pulls off the social curation quite well, but this isn't all the app does. It also sports YouTube integration, lets you follow other ShowYou users, and offers curated categories of content like Art & Design, Comedy and Music. All told, there is a ton of video content packed into this one little app and it works exceptionally well on the TV screen.\n\nWhile networks and cable channels struggle with how to offer content to tablet users without upsetting the existing order, PBS is a bit more liberal. Its iPad app features full episodes of many programs, including Frontline, Nova and News Hour. Conspicuously absent is the wildly popular Downton Abbey, which is normally available to stream online while the season is airing.\n\nPBS doesn't make videos available indefinitely and the selection is somewhat limited, but they do a better job than most networks of offering content to tablet users without requiring a cable subscription to view it.\n\nAs far as iPad apps go, Al Jazeera's is pretty bare bones. It doesn't have a slick, fluid UI that will blow you away, but rather its value is in the content it offers. In the United States, Al Jazeera English is not carried by most cable operators, even though the network has received praise from sources as unlikely as Donald Rumsfeld for its coverage of recent turmoil in the Middle East.\n\nThis app solves that problem, at least for iPad and Apple TV owners. The first tab is a live stream of whatever is being broadcast on Al Jazeera English at the moment. The other three tabs are just parts of the channel's websites framed into the app, and unfortunately not all of the video content found there is in a tablet-ready HTML5 format. Still, the live stream alone makes this app worth watching.\n\nTED's is another well-designed, video-heavy iPad app that works well on the TV screen. Since some TED talks are on the longer side, they're even more appropriate for the \"lean back\" viewing experience.\n\nThe app itself is great. The content never expires and it can be navigated by recency, theme, tags or even adjectives like \"courageous,\" \"funny\" or \"jaw-dropping.\" You can also save your favorite talks locally so they don't need to be streamed.\n\nVideo is the only thing for which the TV screen is well-suited. The Guardian's popular Eyewitness app is simply a slideshow of full-screen, beautiful news photographs from around the world.\n\nIn terms of functionality, you could hardly get more simplistic, but these images comprise some of the best recent examples of photojournalism and they deserve to admired on a big screen.\n\nThen there's music. More and more, people are using their Internet-connected TV as a sort of modern, household jukebox. Apps like Pandora are standard on many smart TVs these days, and streaming services like Spotify and MOG have been quick to develop their own apps for various Internet TV platforms.\n\nWhich app you go for will obviously depend on which service you're subscribed to. As far as user experience goes, Rdio and MOG both win for having developed form factor-appropriate apps for the iPad, rather than scaling up their iPhone apps. We wish we could say the same for Spotify, which is apparently still working on that particular feature.\n\nOf course, if you already subscribe to Spotify, go ahead and use their app to stream music from your TV. It works just fine and a bad UI isn't exactly a deal-killer for an app whose sole purpose is to deliver sounds rather than pictures."},{"articleId":"15191","title":"DIY Mini Aquaponic Vegetable and Fish Farm [Weekend Project]","source":"Lifehacker.com","articleLink":"http://feeds.gawker.com/~r/lifehacker/vip/~3/JefcTUugF9c/diy-mini-aquaponic-vegetable-and-fish-farm","displayContent":"Aquaponics is the combination of hydroponic gardening and aquaculture (fish farming) in an integrated system that uses fish waste to fertilize the vegetables. Commercial aquaponic systems can be both massive and expensive but a simple backyard system can be put together for around two hundred bucks, less if you're good at scrounging materials.\n\nInstructables user Engineering for Change provides a basic plan that can utilize a variety of pipes and water barrels. To construct the setup in the photo above you'll need 15-20ft of 4-in diameter PVC or ADS pipe, 4 pipe elbows, 4 pipe T connectors, 15-20ft of pex or aquarium tubing, two 50-gallon drums,burlap, scrap wood, and a water and air pump. You'll also need a power drill and a way to cut 1-in holes and 3-in holes. The system should take around two hours to assemble.\n\nFull step-by-step instructions and photos can be found at the source link below, but you're basically drilling many holes in the PVC pipe to allow access to plants, assembling the pipes, adding cheap plastic cups with the bottoms perforated as mini-planters, and assemble the tubing to pump water from one barrel to the four vertical pipes.\n\nYou'd buy small trout or tilapia minnows for the 50-gallon barrels and use burlap or peat moss to give plants a surface to latch onto. The water from the fish tanks would pump out the fish waste on the the plants which would benefit from the fish waste fertilizer. Other than the source of electricity for the air/water pumps this system requires little else in the way of inputs. It's probably not practical for everyone, but if you're a gardener with a touch of mad genius you may want to give it a try. I know I will one day."},{"articleId":"13577","title":"Is Technology A Zero-Sum Game?","source":"TechCrunch.com","articleLink":"http://techcrunch.com/2012/03/31/is-technology-a-zero-sum-game/","displayContent":"Editor?s note: Contributor Ashkan Karbasfrooshan is the founder and CEO of WatchMojo, he hosts ashowon business and has publishedbookson success.  Follow him on Twitter @ashkan.\n\nIn last week?s Get Rich or Die Trying article, I mentioned that ?tech is a zero-sum, winner takes all game?.  A reader objected, arguing: ?I think that may be an inappropriate use of the term ?zero-sum? ? one company?s increase in profits (or revenue) does not mean a competitor must see declining profits (or revenue)?.\n\nHistory suggests that Jack Welch?s philosophy that ?a company should be #1 or #2 in a particular industry or else leave it completely? is even more applicable to the tech industry, where the top player can build a sustainable and ever-growing business but everyone else is practically better off getting out.\n\nExamples of market dominance by the #1 that come to mind include:\n\n-          Google in search, -          Facebook in social networking, -          Groupon in daily deals, and -          Amazon in e-Commerce.\n\nThis doesn?t mean that the:\n\n-          #1 player isn?t susceptible to the Innovator?s Dilemma, or -          #2 competitor can?t build a massive business.\n\nIndeed, Microsoft?s Bing or Living Social are meaningful #2?s in search and daily deals respectively, but clearly the network effects and economies of scale that come with market share dominance make it nearly impossible for challengers to remain relevant over-time.  Monopolies are nothing new and come and go: Google is the evolution of Standard Oil, AT&T and Microsoft in search, you can argue that Apple is next in line in mobile.\n\nWhat is Zero-Sum Game Anyway?\n\n?In game theory and economic theory, a zero-sum game is a mathematical representation of a situation in which a participant?s gain (or loss) of utility is exactly balanced by the losses (or gains) of the utility of the other participant(s). If the total gains of the participants are added up, and the total losses are subtracted, they will sum to zero.?\n\nIndeed, while the tech sector is huge, within each segment, you see a zero-sum game from each individual purchasing decision out.  For example,\n\n-          a consumer will buy a Mac or PC; an iPhone or Android device, etc. -          a business will adopt a solution from Oracle or Siebel, for example,\n\nBut it?s rare for a consumer to buy or a company to adopt both.\n\nIf you repeat this binary-like decision process throughout the industry and economy, you get a zero-sum situation where one competitor?s gains come at the expense of others? in the industry: Apple?s iPhone sales obviously put a dent in the Blackberry; and its iPads are evidently going to affect PC sales ? no matter how much some want to deny it.\n\nIt?s Like This in Most Industries, The Only Difference Ss Severity\n\nI run an online video content company and categorize video companies into four quadrants:\n\nClearly there?s a lot of overlap and how those four interact with one another merits an article in of itself (or hundreds).  While technology (with a lower case) enables Content companies, it increasingly underpins Distribution, Technology and Advertising companies.\n\nAs such, I see this zero-sum phenomenon every day with the latter three.  When TechCrunch?s parent AOL bought 5Min for example, it was a matter of time before AOL stopped licensing Brightcove?s Online Video Platform and instead use 5Min?s player.  Seeing how AOL and 5Min were my distribution partners, I kept that thought to myself, but it was a matter of time.  Today AOL?s main platform for video is indeed 5Min (note: I am not an AOL/5Min employee).\n\nIn content, it?s not really like that. ABC, CBS, FOX, NBC all have meaningful franchises.  Sure, if you watch FOX on Sunday at 6pm then you may not watch ABC at that time, increasingly with cord-cutting and time shifting that isn?t the case anymore.  In fact, content is so not a zero-sum game that a company like Viacom has multiple brands to address that reality.\n\nIndeed, if you want to travel to Barcelona, you won?t watch one video or read an article, you will read/watch many and I?d argue that content consumption ? like a drug ? just creates more demand.\n\nBut if you want to book a ticket to Barcelona, you will either use Travelocity or Expedia, for example.\n\nThat makes content a less-risky endeavor, and, with digital media and digital distribution reducing the marginal cost of production and distribution, then content has become a better risk-adjusted bet, though arguably not as scalable and certainly not a winner-takes-all gamble.\n\nIt will take an entire generation before investors realize this; though some argue that it?s already started. According to media guru Jack Myers, ?VC funds are being redirected away from tech and toward content. Technology-based venture opportunities in the media and advertising space have been largely played out. Bottom line, venture capital funds will be shifting from technology to content, context, commerce and research.?\n\nI?m not holding my breath, even though digital content is effectively the new software.\n\nIn Tech, Competition Becomes Blurry Over Time\n\nThe same way that the Internet has changed content, it has also changed technology.  For one, with consumer-focused technology companies being free, advertising-supported businesses, the prevailing asset isn?t necessarily the underlying hardware or software, but rather, the audience.\n\nThis is why tech companies are all seemingly fighting one another:\n\n-          Facebook vs Google in search and social networking, -          Google vs Apple in mobile, -          Amazon vs Apple in tablets and entertainment, -          Microsoft vs Google in search.\n\nYou get the idea: in tech, everyone morphs into everyone?s competitor? and since the main asset ? the audience or consumer base ? is so fleeting, tech becomes an even riskier bet.\n\nWhereas initially the Web pitted ?content vs. tech?, as the Web matures, it becomes ?tech vs. tech? with Content becoming Switzerland amongst Distribution, Technology and Advertising companies.\n\nIn the real world, there is no perfect example of a zero-sum game ? granted.  But whereas Jack Welch argued that a business ought to be #1 or #2 or get out, the network effects that the web has unleashed over time force technology (lower case) businesses to either be #1 or get the hell out."},{"articleId":"13498","title":"Ultra Disappointment? Nah, Ultrabooks Are Just Getting Started","source":"TechCrunch.com","articleLink":"http://techcrunch.com/2012/03/30/ultra-disappointment-nah-ultrabooks-are-just-getting-started/","displayContent":"This year was supposed to be the year of the Ultrabook. It was supposed to be the year where svelte notebooks became standard. It was supposed to be the year that Intel?s latest ultra-mobile platform gave Windows PC makers something to celebrate.\n\nBut that?s not happening. At least not yet. And that shouldn?t come as a surprise.\n\nPCs are struggling in this age of the iPad and shipments fell 6% in the last few months of 2011. Gartner expects PC shipments to grow just 4.4% in 2012. A Gartner analyst told TechCrunch that consumers just aren?t replacing existing PCs with new models. The one bright spot is Apple who managed to increase its 4Q2011 shipments by 21%. Intel designed the Ultrabook platform to allow other PC makers to quickly replicate Apple?s formula for the MacBook Air.\n\nIntel coined the term Ultrabook to refer to a very thin notebook that uses a low-voltage CPU, SSD hard drive, long battery life, and ideally, a price under $1,000 ? so in other words, a MacBook Air clone.\n\nThe first crop of of these thin notebooks hit last fall from Asus, Acer, Toshiba, and Lenovo. These models were priced around $1,000 and offered a fair balance of computing power and battery life ? but most reviews still favored the Ultrabook?s chef competitor, the Apple?s MacBook Air.\n\nSeveral key Ultrabooks were announced at CES 2012. Dell announced the carbon-fiber XPS 13, HP revealed the entry-level Folio 13 and high-end Envy 14 and Samsung unveiled the Series 5 and Series 9 Ultrabook, with the former challenging the traditional definition of an Ultrabook thanks to an optical drive.\n\nFor the most part the tech press was generally excited about these new models. Besides the Samsung Series 9 which comes out next month, all of these models are currently available. But they don?t seem popular yet. The Asus Zenbook, which was released back in October of 2011, is the lone Ultrabook on Amazon?s list of best selling notebooks. Neither Best Buy nor Newegg list an Ultrabook on their best sellers lists. On all three sites consumers overwhelmingly favor inexpensive Windows notebooks or pricy Apple MacBooks.\n\nThe Ultrabook is likely falling victim to past computer selling strategies. For years Windows PC makers raced to the bottom, conditioning consumers into valuing price over portability. Now, when PC makers are trying to hawk pricy, but very nice computers, consumers are seemingly ignoring the offering. They?re instead opting for cheap, bulky, but in many cases, more powerful notebooks than Ultrabooks that cost twice as much.\n\nCNET suggests that Ultrabooks are done, killed by the PC industry. By including optical drives and traditional spinning disk hard drives, they?ve diluted the meaning of the Ultrabook, says CNET. That?s fair, but at the same time major product changes cannot happen in a period of several months. Ultrabooks are just 6 months old. PC makers cannot simply pull the plug on their low price options, which consumers are currently favoring. Samsung, the main example in CNET?s article, is including familiar elements in its Ultrabook offering. Believe it or not, some consumers still want optical drives in their computers. They shouldn?t have to slum with an 8-pound monster just to have a DVD drive.\n\nIt?s a bit premature to call Ultrabooks a failure. Intel delayed the next-gen platform that was supposed to drive Ultrabook prices lower while increasing their overall power. Meanwhile, retailers and PC makers must retrain consumers to stop looking at the raw clock speed and hard drive size and instead think mobility with low-voltage, but still capable, CPUs and small SSD hard drives. If these marketers do it right, the term Ultrabook will never be associated with a certain sub-set of computers. The average consumer will just naturally gravitate towards the new models that happen to be a tad more expensive, but also thin and light.\n\nWhen Intel unveiled the Ultrabook in the middle of last year, part of the excitement came from the high-end feel of the computers; MacBook Airs for the everyman. The move to thin and cheap computers will happen. Ultrabooks are still the future even if these notebooks do not fit Intel?s definition for several generations."},{"articleId":"12848","title":"6 Ways Spotify Could Improve Its Mobile User Experience","source":"ReadWriteWeb.com","articleLink":"http://feedproxy.google.com/~r/readwriteweb/~3/8Wiuqk-QBk0/spotify-mobile-user-experience-improvements.php","displayContent":"Spotify hasn't even been available in the U.S. for an entire year. Still, its growth has been phenomenal, and it appears to be continuing unabated, thanks in part to its deep integration with Facebook. The product's other big initiative of the last several months has been its third-party app marketplace, which extends Spotify's functionality by leaps and bounds.\n\nWhen the service finally did launch in the U.S. last July, I tried it for 48 hours, then swiftly dumped both Rdio and the iPod app on my iPhone. After all, Spotify combined the giant streamable cloud library of services like MOG and Rdio with the ability to sync local MP3s to your device, just as you've always been able to do via iTunes. Each month when my checking account is debited $9.99, it's primarily that mobile listening experience that I'm paying for (along with the absence of advertising). For the most part, it's worth it.\n\nHaving used the service on my phone everyday for the last eight months, I've developed a list of things I wish it did better. None of these things is enough to cause me to think twice about my subscription, but when a mobile app is weaved this thoroughly into your day-to-day life, you tend to grow a little picky and particular about how it should work.\n\nWhen it comes to social media integration, Spotify's mobile app scrapes by on pretty much the bare minimum. You can share songs via Twitter and Facebook, and under the \"Friends\" tab, you can view playlists from your Facebook connections. That list includes everybody you know on Facebook who has signed up for Spotify, even if they aren't active. As a result, I've got a lot of people in my \"Friends\" list with absolutely no music saved. This isn't at all useful to me. Those people could be easily filtered out.\n\nThe potential here is practically limitless. Spotify's Facebook integration presumably gives it access to data about which songs are shared most widely. Tapping into Twitter's API could allow them to build a list of songs that are currently trending on Twitter, as well.\n\nSpotify already has a list of your social connections, but they could be baked into the mobile experience a little more seamlessly. Music-sharing could be expanded beyond the usual players, as well. Social integration into music services isn't necessarily a nut anybody has cracked yet (just ask Apple), but if anybody is well-positioned to do it, Spotify is.\n\nThe iPhone app for Spotify works perfectly fine on the iPad, and doesn't even look that bad when blown up to double its original size. But in this day and age, the tablet form factor calls for an application that takes true advantage of the screen real estate and user-interface possibilities.\n\nMOG and Rdio, Spotify's two chief competitors, both have iPad-specific apps and they both make effective use of the bigger screen. Rdio launched theirs a few weeks after Spotify launched in the U.S., and MOG just released an iPad app a few days ago.\n\nGranted, streaming music is probably more suited to the smartphone experience, but at this point, enough people are using their iPads as a sort of impromptu radio at home to justify making the experience as enjoyable and tablet-appropriate as possible.\n\nOne thing that's always bugged me slightly about Spotify is its user interface is not very album-centric. New releases and search results are easily browsed by album cover, but one's own collection is basically a gigantic list of songs. In fact, the library itself is just a series of playlists, which includes starred tracks, your inbox and local MP3s, as well as any other custom playlists you've created.\n\nBy comparison, when you're browsing your music in Rdio's mobile app, it feels a lot like the iTunes UI, in the sense that content is arranged by album. It's a natural and intuitive way for music to be organized. As a result of the way Spotify is designed, I find myself using shuffle and playlists a lot more, rather than listening to albums from beginning to end.\n\nThis one might seem a little nit-picky, but the last time I was in New York, I rode the subway from Queens to Manhattan to attend a conference and made the mistake of not launching Spotify before the train went underground. What I didn't realize was that the app needed to re-authenticate my log-in info before the service would work. Thus, I couldn't listen to any music during my subway ride, since the app needed an Internet connection to hit Spotify's servers and log me in, even if all of my music was cached locally.\n\nApparently, Spotify needs to log you in every time you launch the app. I'm sure there are legitimate technical and security-related purposes for this, but it's inconvenient when you're not able to get online, and all you want to do is access your local MP3s and cached songs.\n\nThe easy way around this would have been to launch the app before losing connectivity, but you'd think that an app designed to work offline wouldn't have this weird little limitation.\n\nOne of the most exciting things about Spotify's desktop client is the third-party app platform it launched in December. By mashing together Spotify's API with other services, the platform opens up enormous new possibilities for the service.\n\nEarly partners include Pitchfork and Rolling Stone for audio-augmented album reviews, Last.fm for music recommendations, Soundrop for group listening and MoodAgent for tonal analysis and song-matching based on the mood of a given track. And this is only the beginning. There are a number of other apps on the platform, presumably with more to come.\n\nNaturally, Spotify can't fit every third-party app into the limited real estate of its mobile applications. There are design, technical and, in some cases, legal issues to consider for each one. Presumably, the best of these apps will find their way to mobile platforms as quickly as is feasible.\n\nAnother thing that Spotify does reasonably well in a desktop environment is offer personalized recommendations to music fans. Their Last.fm integration does a great job of this, and other Echo Nest-powered features such as Spotify Radio could pose a legitimate challenge to services like Pandora.\n\nThe ability to stream songs based on an individual song or artist, as Pandora has done for years, could be a huge bonus for mobile users. Incorporating MoodAgent's emotional analysis could play a key role here as well. Whether a user wants to discover new music based on their existing tastes or just isn't entirely sure what they want to listen to at a given moment, a more serendipitous listening experience would be a worthwhile feature to have in a mobile context.\n\nPersonalized recommendations are relatively new to the Spotify desktop client, so we're not surprised that it's not available for mobile users yet. Like the third-party apps, it's something that is presumably on its way."}]
